[
  "70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. IAC-19.C4.3.5x52514 Progress in Additively Manufactured Copper-Alloy GRCop-84, GRCop-42, and Bimetallic Combustion Chambers for Liquid Rocket Engines Paul R. Gradla*, Dr. Christopher S. Protzb, Dr. David L. Ellisc, Sandy E. Greened a n Systems Department, Component Technology Development/ER13, Huntsville, AL 35812, Paul.R.Gradl@nasa.gov b n Systems Department, Component Technology Development/ER13, Huntsville, AL 35812, Christoper.S.Protz@nasa.gov c ructures Department, High Temperature and Smart Alloys Branch, 21000 Brook Park Road, Cleveland, OH 44135, David.L.Ellis@nasa.gov d n Systems Department, Component Technology Development/ER13, Huntsville, AL 35812, Sandra.E.Greene@nasa.gov * Corresponding Author Abstract Additive Manufacturing (AM) has significantly evolved over the last decade for use in the aerospace industry, particularly for liquid rocket engines. AM offers a considerable departure from traditional manufacturing to rapidly fabricate components with complex internal features. High performance liquid rocket engine combustion chambers that operate in a high heat flux environment are fabricated using a copper-alloy liner with a series of integral coolant channels. Copper-alloys provide the necessary conductivity and material strength for adequate design margins offering high performance without the need for film coolant. Copper-alloys present unique challenges to properly melt the powder in laser-based AM processes due to their high reflectivity and conductivity. Starting in 2014, nd Glenn Research Center (GRC) have developed a process for AM of GRCop (Copper- Chrome-Niobium) alloys using Selective Laser Melting (SLM). GRCop, originally developed at GRC, is a high conductivity, high-strength, dispersion strengthened copper-alloy for use in high-temperature, high heat flux applications. acterization and testing, along with hot-fire testing, to demonstrate that GRCop-42 and GRCop-84 alloys are suitable for use in combustion chambers. Additional development and testing has been completed on AM bimetallic chambers using GRCop-84 liners and superalloy jackets, fabricated using two Directed Energy Deposition (DED) processes: Electron Beam Freeform Fabrication (EBF³) and Blown Powder DED. M chambers using GRCop-84, GRCop-42, and bimetallic chambers in Liquid Oxygen (LOX)/Hydrogen, LOX/Methane, and LOX/Kerosene propellants. Keywords: Additive Manufacturing, Laser Powder Bed Fusion (L-PBF), GRCop-42, GRCop-84, Liquid Rocket Engines, Selective Laser Melting (SLM), Combustion Chambers, Channel-Cooled Chambers, Regeneratively-cooled chamber, Regen chamber, Bimetallic Additive Manufacturing, AM, DED Acronyms/Abbreviations Assembly (TCA), United States (US) National Additive Manufacturing or Additively Manufactured Aeronautics and Space Administration (, Electron Beam Freeform Fabrication (EBF3), Gaseous hydrogen 1. Introduction (GH2), Glenn Research Center (GRC), Isostatic Pressing Additive Manufacturing (AM) is an emerging (HIP), thousand pound-force, thrust (K-lb), George C. fabrication technology being used across the aerospace f Marshall Space Flight Center (MSFC), Low Cycle industry as a new approach for fabricating complex Fatigue (LCF), Low Cost Upper Stage Propulsion components. The United States (U.S.) National (LCUSP), Liquid Oxygen (LOX), Kerosene (RP-1), Aeronautics and Space Administration ( Chamber Pressure with U.S. industry partners have been developing the use (Pc), Pounds Square Inch, Gage (psig), Methane (LCH4), of AM specific to complex liquid rocket engine Rapid Analysis and Manufacturing Propulsion components to significantly reduce the lead time and Technology (RAMPT), Room Temperature (RT), costs associated with their fabrication. Regeneratively Selective Laser Melting (SLM), Thrust Chamber (regen) cooled combustion chambers are an ideal application of the AM technology due to the complexities IAC-19-C4.3.5x52514 Page 1 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. of the design and an inability of traditional manufacturing Successful hot-fire testing of this 35,000 (35K) lb f to meet desired geometries. AM is also an excellent bimetallic chamber is shown in Fig. 1. candidate to apply the structural jacket instead of using traditional brazing. AM processes have been shown to significantly reduce the lead time for thrust chamber fabrication and reduce production costs, making use of alloys that optimize the performance of combustion chambers. Several AM processes, specifically laser powder bed fusion (L-PBF) or selective laser melting (SLM), have matured over the last decade for a variety of materials, yet a limited number of metals are available using this process. While the availability of SLM materials for aerospace components is continuing to expand, a majority of the market is primarily focused on superalloys. specifically copper-alloys to make use of the AM process for combustion chambers. High Fig. 1. Hot-fire testing of LCUSP Bimetallic AM performance, liquid rocket engine, combustion chambers Chamber. that operate in a high heat flux environment are fabricated using a copper-alloy liner with integral coolant In addition to the LCUSP chamber, necessary completed significant material characterization and conductivity and material strength for adequate design testing on these processes, along with additional hot-fire margins without the need for film coolant. Yet, copper- testing, to demonstrate that AM GRCop-42 and GRCop- alloys present unique challenges to properly melt the 84 alloys are suitable for use in a variety of combustion powder in laser-based AM processes due to their high chambers. Efforts have been completed on AM reflectivity in the near-IR wavelengths typically used for bimetallic chambers using GRCop-84 liners with Alloy AM and high thermal conductivity. 625 (Inconel 625) structural jackets. In addition, Starting in 2014, ire testing on various AM chambers with Center (MSFC) and Glenn Research Center (GRC) have GRCop-84, GRCop-42, and bimetallic chambers using developed a process for AM of GRCop (Copper- Liquid Oxygen (LOX)/Hydrogen (H2), LOX/Methane Chrome-Niobium) alloys using SLM. GRCop, originally (LCH4), and LOX/Kerosene (RP-1) propellants. Future developed at velopment and flight programs can make use of these strength, dispersion strengthened, copper-alloy for use in advancements in AM GRCop-84 and GRCop-42 alloys high-temperature, high heat flux applications. uid rocket engine goal was to expand the list of available materials for applications. These cket engines, by providing the development and process significantly and also made process parameters dissemination of data on GRCop, specifically GRCop-42 and characterization data available to industry to enable (Cu-4 at.% Cr-2 at.% Nb) and GRCop-84 (Cu-8 at.% Cr- commercial supply chains. Several industry partners 4 at.% Nb) alloys. have continued to advance the GRCop-84 and GRCop- The SLM process can fabricate a combustion 42 materials in addition to exploring other copper-alloys chamber liner with complex internal coolant channels such as C-18150, C-18200, C-18000, and Glidcop. using a monolithic alloy, such as GRCop. However, some combustion chamber designs require an additional 2. Process Overview and Development structural jacket due to handle high (axial) thrust and hoop or circumferential loads. An optimized solution is The GRCop family of alloys exhibit exceptional high to create a copper liner for the chamber and then apply a temperature mechanical and good thermophysical second high-strength-to-weight alloy using a secondary properties. The alloys were developed as a high heat flux, AM process with Directed Energy Deposition (DED), high strength alternative to other common aerospace specifically Electron Beam Freeform Fabrication (EBF³) copper alloys, such as NARloy-Z and C-18150 (Cu-1 Cr- and Blown Powder DED at The alloys are dispersion strengthened Center (LaRC). Under rimary strengthening from the Cr Nb Propulsion (LCUSP) program, these AM techniques 2 phase. The material is preferred for use in combustion were used to deposit a high strength superalloy onto a chambers due to: GRCop liner, forming a bimetallic mechanical bond and the necessary strength to handle structural loads. IAC-19-C4.3.5x52514 Page 2 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. 1) Oxidation and blanching resistance during or secondary processes such as brazing or other thermal and oxidation-reduction cycling [5], manufacturing steps, and it is not possible to perform 2) A maximum use temperature around 800 ºC, subsequent solution and precipitation heat treatments. depending upon strength and creep The advantage is typically on the order of two times the requirements strength of competing alloys such as NARloy-Z (Cu-1 3) Good mechanical properties at high use Ag-0.5 Zr). Creep failure modes can occur when the liner temperatures, material is operated for sustained durations at high 4) Lower thermal expansion to reduce thermally temperatures. GRCop alloys typically can withstand induced stresses and low cycle fatigue (LCF), 10% to 25% greater stresses than most competing copper 5) Established powder supply chain, alloys with even larger advantages above about 600 °C. 6) Mature AM process that provides consistent, The intrinsic oxidation rates of GRCop-42 and minimum material properties [6]. GRCop-84 up to 800 °C are up to one order of magnitude GRCop-84 is the most common alloy, having lower than most competing copper-based alloys. completed substantial process and property development GRCop-42 and GRCop-84 have demonstrated using SLM under the LCUSP program. Recent exceptional thermal stability up to 1050 °C or 98% of the advancements of GRCop-42 though are showing that it melting point of copper. Essentially no mechanical provides a higher conductivity compared to GRCop-84, property or microstructural changes have been observed and its maturity level is rapidly increasing. The up to 800 °C and the alloys retain at least half their tensile conductivity of the wrought (non-AM) GRCop-84 and strength when exposed up to 1050 °C for 100 hours. GRCop-42 materials are compared in Fig. 2. Short term thermal exposures to temperatures up to 1050 °C for simulated manufacturing steps such as brazing 420 have resulted in minimal property degradation. In Cu comparison, all precipitation strengthened, low-alloy y high conductivity copper-based alloys would return to vit 380 mechanical properties similar to pure copper at these u cti 360 GRCop-42 higher temperatures. o n d m K) 340 There are some differences between GRCop-84 and m al C ( W/ 320 L G o R w C o F p e -84 GRCop-42, and they can be traded for various applications. GRCop-42 trades somewhat lower h er 300 mechanical properties, such as strength, for higher T 280 GRCop-84 thermal conductivity, and thus a lower wall temperature. 260 The ductility of GRCop-42 is generally superior to that 0 200 400 600 800 1000 of GRCop-84. With only half the Cr Nb content of Temperature GRCop-84, this was expected. Both alloys have (°C) sufficient ductility for most applications, and will deform Fig. 2. Thermal Conductivity of Wrought GRCop large amounts without failure. The major difference Alloys and Pure Cu between the alloys is observed in low cycle fatigue (LCF) in the stresses observed during strain control testing. The Both alloys are capable of operating at temperatures difference in stresses at the minimum and maximum up to 800°C, and they have been successfully hot-fire strains was calculated, and Fig. 3 shows the total stress tested in an oxidizing environment to above 750°C. In range for each strain at the three test temperatures. This comparison, pure copper is limited to approximately made GRCop-84 preferable for reusable launch vehicles 200°C, and most copper alloys cannot exceed 500°C [7]. requiring lives of hundreds of missions. Substitution of GRCop-42 or GRCop-84 for NARloy-Z, C-18150, or another precipitation strengthened copper- alloy, could result in a 200°C or more increase in temperature capability, providing higher performance trades or increased margin. These attributes, in addition to the rapid development of the GRCop alloys using the SLM process, make them an attractive option for use in high performance combustion chambers. The strengths of GRCop-42 and GRCop-84 exceed almost all other copper-based alloys in the 500-700°C range. They also exceed all other precipitation strengthened copper-based alloys at all temperatures if the part must be given a high temperature heat treatment IAC-19-C4.3.5x52514 Page 3 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. fabrication of components with desired properties and a sustainable supply chain. In the SLM development of the GRCop alloys, a series of integrated tasks across the material and process, including:  Establishing and controlling the powder supply chain  Scalability and transfer of the SLM process to various machines and size scales  Optimal work flow and processing time of GRCop-42 and GRCop-84  Characterizing the material and establishing a database of AM properties for design engineers (cycles)  Understanding property and microstructural Fig. 3. Low Cycle Fatigue of Wrought GRCop-84 sensitivities to powder supply, print parameters, and GRCop-42. and design features  Developing best design practices for the SLM In all cases, GRCop-42 had a lower stress range than GRCop alloy use in combustion chambers GRCop-84, and the difference increased with  Demonstrating component hardware in a temperature. This was consistent with expectations as relevant environment and testing at aggressive GRCop-84 has a higher strength and requires a higher conditions to validate designs and property stress to deform it to these strains. This indicates that the databases load bearing capability of GRCop-42 in an LCF  Dissemination of data to US industry partners environment will not be as high as GRCop-84. This will and US commercial print service vendors. need to be addressed in some designs, but since the LCF The high level process flow for SLM GRCop is thermally driven for a liner, it is expected that the total development can be seen in Fig. 4. The powder supply thermal expansion driven by the temperature change will chain was expanded and matured, but it required some be the key determinants for the LCF performance. The variations on printing and lessons learned to be fed back analyses will also need to address the higher coefficient to the powder atomization suppliers. In parallel, of thermal expansion for GRCop-42 relative to GRCop- mechanical test specimens and design databases were 84 when calculating the thermal stresses and strains. being developed to capture the data and apply it to the With the increased thermal conductivity, wall chamber designs. Hot-fire testing was conducted in temperatures will also be lower and stresses may be parallel, as the overall process was matured to understand equivalent in designs. early performance characteristics of the GRCop All initial SLM development was completed using materials. GRCop-84 since it was the more mature alloy with wrought (extruded, hot rolled, cold rolled and forged) data for comparison. However, after successful development using this alloy, GRCop-42 was pursued for Powder SLM Post- some performance improvements. Supply Process Processing Chain The GRCop-42 has the following advantages over GRCop-84, based on the envisioned engine application: 1) Improved thermal conductivity, 2) Limited and acceptable reduction in strength, Design GRCop Mechanical Testing 3) Simplified powder atomization based on powder Property SLM Hot-fire Evaluation supplier comments, Database Design Application Performance 4) Less costly fabrication build times based on increased layer height Development on both alloys has been conducted at Fig. 4. High-level process flow of SLM GRCop- ow exist alloy development. in the U.S. for both GRCop-84 and GRCop-42. 2.2 GRCop SLM Powder Supply Chain 2.1 GRCop-alloy SLM Process Development An important aspect of the GRCop alloy development Fabrication using the SLM process must consider the was establishing and controlling powder sources to end to end design, atomization, additive processes, and ensure that the GRCop powders met all requirements. post-processing requirements to provide repeatable The GRCop alloys are atomized using high purity IAC-19-C4.3.5x52514 Page 4 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. elemental charges under argon gas atomization. Handling infill parameters yielded high densities and good within an inert or vacuum environment is critical for the strengths and ductilites. A minimum density of 99.2%, GRCop powder to avoid oxygen contamination. and in many cases higher, was achieved by SLM prior to Undesired trace elements such as aluminium and silicon a Hot Isostatic Pressing (HIPing) operation. Full density that may indicate non-metallic inclusions and iron which was easily achieved after HIPing. reduces thermal conductivity (Fig. 2) must be limited. Best results with GRCop-42 was obtained using The ratio of Cr:Nb is also critical as a slight excess of Cr powders that contained the fines (-1250 mesh) as shown is required to prevent hydrogen embrittlement. The in Table 2 [ 9 ]. Based on several d GRCop-42 are applications, the elongation was one of the driving provided in Table 1. properties since ductility is important in the thermal cycling of a combustion chamber at high temperature. Table 1. Powder chemistry comparison of GRCop- because the elongation and strength was best with the 42 with GRCop-84. fines, it was determined that future production powder lots will include the fine particles and limit the maximum Element GRCop-42 Wt % GRCop-84 Wt % diameter of the powder to 45 µm. Cr 3.1 – 3.4 6.2 – 6.8 Nb 2.7 – 3.0 5.4 – 6.0 Table 2. Mechanical characterization summary of GRCop-42 with various powder sizes. Fe Target <50 ppm Target <50 ppm O Target <400 ppm Target <400 ppm Powder Size Tensile Yield Elong. Al <50 ppm <50 ppm Source (mesh) (MPa) (MPa) (%) Si <50 ppm <50 ppm Vendor 1 -325 without fines 265 153 8.7 Cu Balance Balance Vendor 1 -270 without fines 234 137 7.2 Cr:Nb Ratio 1.12 – 1.15 1.12 – 1.15 Vendor 1 -325 with fines 359 173 32.5 Vendor 2 -325 without fines 342 186 21.3 Various vendors were established to produce the Vendor 2 -325 with fines 419 218 28.4 GRCop-84 and GRCop-42 powders for SLM. While it Vendor 3 -325 without fines 355 182 25.4 took some iterations early in development, all vendors were able to successfully melt these alloys and meet the Separate studies were completed on powder re-use chemistry specifications, including oxygen and trace and determined it is feasible to mix virgin and used elements. Another driver behind maturing the powder powder so long as the reused powder does not have supply chain was cost reduction. Over the course of 5 excessive oxidation. Fully used powder can also achieve years in maturing the AM process with several suppliers, desired mechanical properties, but there is about a 2% the cost was reduced by 3x. There were some minor reduction in ultimate strength and no discernible differences between the vendors for mechanical difference of tensile and elongation properties at room properties, although they all performed as expected and temperature with once-used fully recycle powder. could be used for SLM processing. The number of vendors has been increased with additional vendors 2.3 SLM Process Development indicating interest. This prevents a single-point loss of The LCUSP program, initiated in 2014, was capability if a vendor chooses to no longer make GCop established to develop the necessary GRCop-84 AM alloys or ceases operations. build parameters, characterize SLM microstructures and Early development and powder lots were specified to mechanical properties, and build and test representative a more traditional SLM sieve size at -325/+1250 mesh chambers. The SLM, of Laser-Powder Bed Fusion (L- (10-45 um). It was determined through further PBF), process uses a layer-by-layer approach, in which development that the fines could be included in the SLM the desired component features are created by melting the powder, which helped improve yield. The specification powder using a laser, as depicted in Fig. 5. was later changed to provide -325/down mesh. The This process for copper alloys has been well change had the additional benefit of increasing the described in prior publications for GRCop alloys [Ref observed elongations, but the increase might be 10,11,12]. The behavior of the GRCop material during confounded by processing parameter changes the SLM process was different than original expected. It An additional powder study with the GRCop-42 was appeared that GRCop-84 was easily melted in the completed during development and produced identical process. Most likely, the 14 vol.% Cr Nb phase is results [8]. SLM build parameters were developed to responsible for a higher absorption of near-IR laser optimize the infill to achieve desired mechanical and energy than pure copper and results in easier heating thermophysical properties. The contouring parameters initially. The reflectivity of copper rapidly decreases with were optimized to minimize surface roughness. The core IAC-19-C4.3.5x52514 Page 5 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. temperature, and the powder should absorb more energy The second observation was that the Cr Nb appears from the laser and heat readily [13]. to have been refined in size. The Cr Nb present in the powder particles is actually an agglomeration of finer Cr Nb particles formed in liquid copper during the gas atomization process. It appeared that thermal, and perhaps mechanical forces, acting upon the agglomerations broke them up and formed the finer particles seen in the SLM sample. This is important because basic strengthening mechanisms such as Ashby- Orowan strengthening predict that the strength of a material will be increased as the average diameter of the particles is decreased [14]. The AM process parameters for GRCop-42 were developed on the same MSFC Concept Laser M2 used for the LCUSP program for GRCop-84, and the parallel, Fig. 5. SLM fabrication of GRCop-84 chambers. commercial service vendors were established to develop machine specific parameters and provide GRCop-42 Parameter and process development for GRCop-84 components fabricated on EOS M290 and EOS M400 was conducted on MSFC’s Concept Laser M2 with a machines. The GRCop-42 development included the build volume of 250x250x250mm. The system had fundamental SLM process parameter development, full proven itself “copper friendly”, making GRCop-84 parts. characterization and mechanical testing of the AM It featured an inert atmosphere glovebox and build material. Representative mechanical properties can be chamber for handling the powder and parts, and the seen in Table 3. 400W infrared laser could readily achieve the high- energy density needed to fully melt the GRCop alloys. Table 3. Summary of SLM GRCop-42 and GRCop- However, the machine features are now standard in most 84 mechanical properties. machines and further development in EOS machines Material Source Tensile Yield Elong have demonstrated equivalent results. Initial Scanning Electron Microscope (SEM) images Machine (MPa) (MPa) (%) taken during development of the GRCop-84 revealed GRCop-84 Extruded 368 197 27 some interesting observations (Fig. 6). First, the SLM GRCop-84 SLM, M2 390 208 30 process did not result in segregation of the Cr 2 Nb GRCop-42 Extruded 354 200 30 precipitates. This is likely due to turbulence in the melt GRCop-42 SLM, M2 359 173 32.2 pool mixing the molten Cu and solid Cr Nb particles. 2 GRCop-42 SLM, M400 355 172 33.6 Once the laser moves away, the liquid-solid mixture rapidly solidified by the conduction of heat out of the Two of the concerns during development were that material through the GRCop-84 substrate. This transferring parameters to different machines and scaling apparently did not allow sufficient time for buoyancy would be challenging. Larger build platforms can have effects to segregate the Cr Nb to the surface of the molten 2 different purge and laser focal plane characteristics as copper. The results was a very uniform distribution of well as radically different thermal environments. Similar Cr Nb throughout the sample. 2 parameters were used when transferring between systems and scaling to larger volumes. Some adjustments were made on different machines based on the specific laser. Overall, similar processing parameters resulted in similar properties that met requirements. The average tensile curves at room temperature (20°C) for the SLM GRCop- 42 built on the MSFC Concept M2 and a vendor’s EOS M400 are shown in Fig. 7. (a) As-Extruded (b) SLM Fig. 6. Scanning Electron Microscope Backscatter characterization of GRCop-84 Cr Nb. IAC-19-C4.3.5x52514 Page 6 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. 700 450 600 aP 400 SLM GRCop-84 M 350 SLM GRCop-42 ,S 500 T U 300 )a P M400 ,h tg n e ( sse rtS 300 GRCop-42 - MSFC HIP rts e lisn e 2 0 0 200 GRCop-84 - MSFC HIP t e 100 GRCop-84 - MSFC No HIP ta m 50 100 GRCop-42 - M400 Vendor No HIP itlU Grcop-42 - M400 Vendor HIP 0 0 100 200 300 400 500 600 700 800 0 2 4 6 8 10 12 14 16 18 20 22 24 26 28 30 32 34 Temperature, ⁰C Strain (%) Fig. 8. Ultimate Tensile Strength vs Temperature of Fig. 7. Stress-Strain curve of SLM GRCop-42/-84 SLM GRCop-84/-42. showing HIP and un-HIP conditions A comparison to SLM GRCop-84 from the MSFC SLM GRCop-84 Concept M2 is also shown. The SLM tensile data follows a 200 SLM GRCop-42 similar trends to the extruded material shown previously. P M T hi h g e h e S r L e M lon g G at R io C n o p co -4 m p a s r a e m d p t l o e s t he d e G m R o C ns o t p ra - t e d ex sl t i r g u h d t e l d y ,h σ ,% 2.0150 material. The SLM material in the as-built (non-HIP) tg n e 100 condition exhibits high residual stresses and higher rts d strength, but the elongation is greatly reduced [15]. This le iY 50 demonstrates the needs for at least a post-build stress % 2 .0 relief heat treatment to achieve good ductility. 0 Additional mechanical test data was completed at a 0 100 200 300 400 500 600 700 800 series of temperatures including elevated temperatures Temperature, ⁰C similar to chamber hot wall operating conditions. The Fig. 9. 0.2% Yield Strength vs Temperature of SLM datasets show repeatable properties and low scatter. The GRCop-84/-42. ultimate tensile strength can be seen in Fig. 8. While the SLM GRCop-84 exhibits an average of 8% higher For a given chamber operating pressure, the ultimate strength at 20°C, the SLM GRCop-42 has minimum wall thickness of a liner must be increased to similar strength above 200°C. This is caused by decrease lower the stresses to acceptable levels. How that affects in the pure Cu matrix strength and its inability to transfer thermal gradients, hot wall temperatures, thermally stress to the Cr Nb particles as efficiently at elevated induced strains and other design considerations must be temperatures. The result is the two alloys have similar examined and will require iterations to determine optimal strengths above 200-400 °C. The strength remains designs in strength limited applications. generally superior to competitive alloys in this The ductility of GRCop-42 is generally superior to temperature range, and exposure of the GRCop alloys to that of GRCop-84 at temperatures above 400°C (due to these temperatures has minimal impact on the properties. the Cr 2 Nb content of GRCop-84). Both alloys have The 0.2% yield strength as a function of temperature sufficient ductility for most applications including liners, can be seen in Fig. 9. While the SLM GRCop-84 exhibits and will deform large amounts without failure. The an average of 14% higher yield strength at 20-400°C, the elongation is shown in Fig. 10 and the reduction in area SLM GRCop-42 has similar strength above 600°C. This is shown in Fig. 11. is one of the major properties that must be traded to get the higher thermal conductivity offered by GRCop-42. IAC-19-C4.3.5x52514 Page 7 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. 45 300 y 250 35 t ,e ru lia f t o n e cre p ε,f 2 3 0 5 iv it c u d n o C la m r )C º * m (/ W ( 1 2 5 0 0 MSFC GRCop42 t n ia rtS 5 S S L L M M G G R R C C o o p p - - 4 2 e h T 0 MSFC GRCop84 0 100 200 300 400 500 600 700 800 0 100 200 300 400 500 600 700 800 Temperature (˚C) Temperature, ⁰C Fig. 12. Thermal Conductivity vs Temperature of SLM Fig. 10. Elongation vs Temperature of SLM GRCop- GRCop-84/-42. 84/-42. The GRCop-42 and GRCop-84 process parameter development yielded the desired initial values for 60 density, mechanical and thermophysical properties, and surface finishes. Additional improvements are being still tn 50 e cre p ,A 40 m m a e d ch e a a n s ic a e l x p te e s r t i i e n n g c , e a i n s d g h a o in t- e f d ir , e b t u e t s t s in u g c c t e o s s b f e u l d p e r s i c n r t i i b n e g d , R ,a 30 later in the paper have been successfully achieved. The e rA GRCop-42 process parameters resulted in an improved n 20 i n SLM GRCop-84 processing time compared to the GRCop-84, with an o itcu 10 SLM GRCop-42 approximately 20% reduction in build time. MSFC and d e R 0 GRC, along with industry partners, have demonstrated 0 100 200 300 400 500 600 700 800 that both are readily printable alloys that can be Temperature, ⁰C additively manufactured into fully dense components Fig. 11. Reduction in area vs Temperature of SLM with consistent properties. GRCop-84/-42. The powder supply chain improved with more vendors capable of meeting the powder specifications Thermal conductivity was also measured with the SLM with GRCop-42 compared to GRCop-84. The ability to samples and as-expected the GRCop-42 demonstrated a meet the GRCop-42 chemistry and vendor competition 5-8% higher conductivity than the GRCop-84 (Fig. 12). also reduced powder pricing, making the overall process The observed decrease in the thermal conductivity at the more economically attractive. highest temperatures is a result of the excess Cr dissolving into the Cu matrix. Generally, GRCop-84 has 2.4 Post-Processing Considerations for Chambers more excess Cr, and the effect is greater. If critical, the Successful development of SLM chambers placed amount of excess Cr could be reduced, but there might be considerable emphasis on the post-processing after initial hydrogen embrittlement issues with hydrogen- and build and removal from the build box. Based on maybe methane-propellant applications. experience, much of the overall fabrication time is post- While not shown in the details of this paper, prior processing of the parts to ensure full part integrity and publications demonstrated details on the surface finish of removal of all loose powder prior to HIPing. Post- the GRCop materials [9,10,23]. There is additional processing of combustion chambers presents additional development being completed to further improve surface challenges for AM due to the complexity of the small finish. internal features. The post-processing considerations include: powder removal and verification of clear channels, build plate removal, HIP, machining, welding, inspections, and flow testing. A generic flow diagram is shown in Fig. 13. A more detailed process discussion was presented in [10]. It should be noted that additional operations are required when the bimetallic combustion chambers are fabricated using a structural jacket. IAC-19-C4.3.5x52514 Page 8 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. cutting technique will depend on requirements and Design of Test Print Wedges or SLM of Chamber available material included in the build between the part Chambers for SLM Model Iterations and the build plate. HIPing was used to both reduce residual stresses and close any remaining porosity to Support/Powder Computed Tomography Remove from Build bring the GRCop to full density. Complete closure of the Removal (CT) Scanning plate pores is critical to prevent blistering when using high pressure hydrogen as a fuel. Following HIP, traditional operations can be Hot Isostatic Machining, Welding, Final Inspection and Pressing (HIP) Finishing Operations Flow Testing completed such as machining of interfaces, welding Fig. 13. General SLM additive process for chambers. operations, porting, and any finishing operations. Generally speaking, GRCop alloys can be easily Powder removal is a critical step and several machined with carbide tooling and respond similar to chambers have been scrapped due to inability to fully other high-strength copper alloys. It is also at this phase remove powder after an AM build. Trapped powder can of the process that a bimetallic jacket would be applied if be caused by a variety of mechanisms, including residual necessary using a secondary directed energy deposition moisture, design features, excessive local heating during (DED) AM process. Following all operations, the the build, build failures (short feed, deformation from chambers completed final dimensional inspections and residual stresses, re-coater arm impacts), oxidation, and flow testing. surface finish. Various techniques are used for powder removal including manual removal, vacuum and 3. AM Bimetallic Jacket Development compressed air, shaker tables, and rotational and variable frequency machines. It should be noted that analysis or In some high pressure and large scale chamber proper precautions may be needed for the powder configurations, a structural jacket is necessary to handle removal process as fatigue loads could be introduced that radial and axial loads. An optimized design makes use of could affect part integrity. higher-strength to density material, typically a nickel The most common technique to verify powder based superalloy, providing a higher strength to weight removal is computed tomography (CT) scanning. This ratio [16,17]. A secondary AM process is used to apply allows confirmation of successful powder removal. An the structural jacket. Several processes have been example of a CT scan on a GRCop alloy combustion evaluated for the jacket including: chamber can be seen in Fig. 14; it is evident which 1. Blown Powder DED channels are clear and which channels are still packed 2. Electron Beam DED with powder. Any fluids should be avoided until full 3. Laser Wire DED powder removal can be verified. 4. Arc-based DED 5. Coldspray Each of these have advantages and disadvantages that have been discussed in prior papers [Ref 18,19,20]. At MSFC, development has been focused on the blown powder DED and electron beam DED. The blown powder DED fabrication technique uses a coaxial nozzle with a central laser source and powder injected (or blown) into the laser focus creating a melt pool and material deposition. The powder is accelerated, or blown, into the melt pool using an inert carrier gas to allow for minimal or reduced oxidation in the high temperature deposition/weld. This DED head system, with integrated focus optics and blown powder nozzle(s), is attached to a robot or gantry system that controls a toolpath defined by the CAD model. echnology using Inconel 625 on both Fig. 14. Computer Tomography (CT) post-processing of standard and hybrid (integrated machining) DED systems chamber showing clogged and cleared channels. [21]. ic Once powder removal was verified for the chamber, jacket through the EBF3 at LaRC under the LCUSP it was removed from the build plate. This was typically program. Under LCUSP, a GRCop-84 SLM liner was accomplished with electro discharge machining (EDM), fabricated in 2-pieces and an Inconel 625 jacket was although a band saw has also been used. The choice of applied. The EBF3 uses a wire-fed electron beam energy IAC-19-C4.3.5x52514 Page 9 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. deposition approach and applied the Inconel 625 included LOX/LH2, LOX/GH2, LOX/RP-1, and structural jacket on the length of the chamber including LOX/LCH4, and all hot-fire testing was conducted at the manifold preparations. The manifolds were then MSFC Test Stands 115 and 116. These chambers were traditionally welded using Electron Beam (EB) welding. typically regeneratively-cooled with fuel; in addition, An example of the LCUSP 35K-lb thrust chamber can some chambers were cooled with water to characterize f be seen in Fig. 15. heat flux performance. MSFC has accumulated over 385 starts and 20,000 seconds on various AM GRCop-alloy and AM bimetallic chambers. The design of AM GRCop- alloy chambers has been discussed in prior literature [10,11,23]. From experience, the two main adjustments to the design process for AM SLM regenerative cooling chambers reside in accounting for the minimum feature size that can be reliably built using SLM and the resultant surface finish [23]. There are also complex geometric features, such as channel geometry and flowpaths that could not be manufactured with traditional techniques. The initial SLM GRCop-84 chambers that completed hot-fire tested used LOX/LCH4 at 4000 lb thrust-class. f A B A throat section was successfully regen-cooled with liquid methane during its testing in 2016 and further allowed thermal models to be developed to characterize two-phase flow, which occurred during the subcritical coolant’s phase change. This chamber design went through a few design iterations to further optimize performance and weight. A series of modified methane cooled chambers later demonstrated active throttling, as C shown in Fig. 16, with full regen-cooling with an as-built D surface of the coolant channels. Smaller methane cooled chambers for 1,000 lb thrust were also developed and Fig. 15. Bimetallic LCUSP Chamber Development f successfully tested with active throttling capabilities. To a) SLM 2-piece GRCop-84 liner, b) Chamber with date, a total of 8 designs of GRCop methane chambers EBF3 Inconel 625 structural jacket, c) Mixing of Inconel have been tested accumulating over 2,600 seconds and 625 with GRCop-84 liner. 72 starts. These chambers were developed for technology development in sons were learned during the bimetallic provided critical performance data of methane cooling. development, including deposition toolpath strategy, proper diffusion and mixing of the Inconel 625 and GRCop base alloy, and shrinkage of the throat and overall length. In some development chambers, nearly 10% shrinkage was observed. The EBF3 used the highest heat input with the electron energy source, but required high heat to achieve good penetration of the Inconel 625 into the copper [22]. The blown powder did provide some reduction in heat with less distortion, but chambers still experienced 3-9% shrinkage. 4. Chamber Hot-fire Testing Results rent SLM GRCop-alloy, channel-cooled, combustion chambers since 2016. Chambers have all been constructed using the previously described AM technology, with some units incorporating the bimetallic AM jacket. The thrust chambers tested ranged operated Fig. 16. Throttling of Methane-cooled SLM GRCop-84 with Pc’s from 200 to over 1,400 psia in a variety of supporting lunar lander engines. propellants and mixture ratios, producing 1,000 to 35,000 lb thrust. The propellants demonstrated in this testing f IAC-19-C4.3.5x52514 Page 10 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. Several of the 1,200-2,400 lb thrust chambers units f served as workhorse hardware to hot-fire test a variety of new SLM injectors, along with channel-cooled nozzle designs and carbon-composite nozzle extensions [24]. These chambers included SLM GRCop-84 and later GRCop-42 liners. Test conditions, including Pc’s, MR’s, and coolant flow rates, were varied to challenge the SLM-fabricated chambers. Fig. 17 shows one of the tests with a Carbon-Carbon (C-C) nozzle. As part of this testing, chambers fabricated on different machines and with slightly different build parameters were evaluated. Some liners from industry partners were fabricated with 50% reduction in surface roughness (indicated by profilometer and optical measurements) that resulted in a Fig. 18. High Duty Cycle Testing on AM GRCop-42 more than 20% reduction in coolant pressure drop. Sustained peak wall temperatures were demonstrated up to 727°C (1,340 °F) on the SLM GRCop-42 liners. Results showed the resilience of the material at these elevated wall temperatures with consistent performance throughout the test series. The hot-fire testing demonstrated aggressive conditions with high Pc/MR and subsequent heat loads. The chambers were run aggressively to promote the environment for potential blanching, but none was observed in the liners. The liner surface remained smooth and showed good oxidation resistance. fire testing under the LCUSP program for a bimetallic AM GRCop-84 chamber at 35,000 lb thrust. Testing f demonstrated the key AM technologies: GRCop-84 SLM Fig. 17. Hot-fire testing of 1.2K LOX/GH2 SLM and EBF3 Inconel 625 jacket, in a relevant environment, GRCop-84 liner with C-C nozzle. testing the AM LCUSP chamber and the one piece AM cooled nozzle to 100% of design conditions. A high duty cycle test series was completed on 2,100 The LCUSP test program was conducted at Test lb f thrust SLM GRCop-42 chambers to demonstrate Stand 116 from October 2017 through March 2018. Both performance and durability of the hardware. This an AM bimetallic full length chamber (Unit 3.0) and a LOX/GH2 thruster was tested in early 2019 using a shortened chamber (Unit 2.2) were tested in the program. water-cooled liner. It was exposed to long duration tests Fig. 19 shows one unit installed for testing. The copper- (180 seconds) and multiple cycle tests [25, 26]. A total of Inconel joint performed well, indicated by the successful 188 tests were completed on the two GRCop-42 liners, hot-fire test campaign at 100% power level (1,400 psia accumulating a combined 8,030 seconds of test time. The and MR=6.2) including the cryogenic shock during conditions included Pc’s up to 1,224 psig and MR’s up to startup. Testing provided excellent data on articles 8.0. The high MR testing was completed at the end of the manufactured with these technologies and even series to fully demonstrate chamber liner durability. The successfully demonstrated a unique chamber repair made first GRCop-42 liner completed 168 tests and a total of after blocked cooling passages were discovered after 7,400 seconds (Fig. 18). initial testing. IAC-19-C4.3.5x52514 Page 11 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. accommodate larger combustion chambers for upper- stage and boost class engine applications, as shown in Fig. 21. In addition to internal roviding GRCop-42 and GRCop-84 as a commercial printing service. Initial material properties from these vendors are included in this paper and updated results will be distributed in future publications. Fig. 19. LCUSP Bimetallic AM chamber installed in the test stand. Fig 1 shows LCUSP chamber during hot-fire. An additional hot-fire test series was completed on subscale bimetallic chambers using LOX/RP-1 at 2,100 lbf thrust with development partner Virgin Orbit. These chambers demonstrated a bimetallic jacket using the Fig. 21. Large-scale SLM GRCop-42 chambers blown powder DED process. This was developed on a fabricated (Diameters ~15\" and Heights ~14\"). hybrid blown powder DED/subtractive machine [21]. ing in late The SLM development work supports r design. For this unit, including Engine Advanced Manufacturing for MSFC’s the structural layer on the chamber was created with a Liquid Engines Office (LEO), the RAMPT project, composite overwrap (of carbon fiber) to reduce weight Lunar Lander applications, Nuclear Thermal Propulsion, by 30%, compared to the same size chamber with a and superalloy structural jacket. Fig. 20 shows this unit being (STMD) Announcement for Collaborative Opportunity hot-fire tested. These chambers are part of the Rapid (ACO) program with commercial space partners. Several Analysis and Manufacturing Propulsion (RAMPT) of these projects are making use of the current scale and program where a series of larger thrust and more evaluating the larger scale. wrap environments will be hardware fabrication and hot-fire testing of the larger tested. The initial testing with the GRCop-84 liners GRCop-42 chambers in early 2020. Investments are demonstrated a series of aggressive wall temperature being made by ions, with temperatures exceeding 93°C (200°F) and property database to further enable the technology on the composite joint. readiness and process maturity. Test samples from the existing scale build platforms (M2, and M290) and the EOS M400 will complete a series of mechanical and thermophysical property testing to develop a design database for the SLM GRCop-42 and GRCop-84. This data is being tested continuously and will be made available to industry partners and general industry. 5. Conclusions process development, material characterization, property databases, and hardware fabrication of GRCop-42 and Fig. 20. Composite overwrap SLM GRCop-84 liner hot- GRCop-84 thrust chambers. General lessons learned and fire testing under RAMPT program. comparisons of the AM SLM GRCop-84 and GRCop-42 alloys were determined: 1) GRCop-alloys are readily printable using SLM, and GRCop-84 development in a GE Concept Laser M2, 2) Full density can be achieved with consistent EOS M290, and EOS M400 SLM machines. The latter properties across several SLM/L-PBF machines, EOS M400 provides a larger build volume to IAC-19-C4.3.5x52514 Page 12 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. 3) SLM GRCop-42 offers 5-8% higher conductivity disseminate data to industry partners and general over SLM GRCop-84, industry. 4) SLM GRCop-42 offers higher ductility over SLM GRCop-84, Acknowledgements 5) GRCop-84 offers higher ultimate and yield The authors would like to thank the large team strength over SLM GRCop-42, involved in the material development and hot-fire testing 6) SLM GRCop-42 showed 20% reduction in of the Additively manufactured SLM GRCop Alloys. processing time compared to SLM GRCop-84, Thank you to Cynthia Sprader, Tal Wammen and the test 7) GRCop-84 and GRCop-42 showed resistance to team at Test Stand 115 for performing outstanding test oxidation during aggressive test environments support as usual. Several individuals were involved in the and high sustained wall temperatures, design, development and testing and provided critical 8) GRCop-84 and GRCop-42 demonstrated support including Chance Garcia, Dale Jackson, Marissa resistance to blanching during high duty cycle Garcia, James Buzzell, Dwight Goodman, Cory Medina, hot-fire testing with high Pc and MR. Kevin Baker, Adam Willis, Bob Witbrodt, Will rent AM Bransdmeier, Ian Johnston, Jonathan Nelson, Van GRCop-alloy channel-cooled combustion chambers Luong, Matt Cross, and Hannah Cherry for analysis. Big since 2016. GRCop-alloy and AM bimetallic chambers thanks to Will Tilson and his mechanical test team for the tested at gnificant number of specimens. Thank you to our 20,000 seconds. The test conditions ranged from 200 to materials, NDE, and inspection teams including Ron over 1,400 psia in a variety of propellants and mixture Beshears, David Myers, John Ivester, James Walker, ratios, producing 1,000 to 35,000 lb thrust. The Doug Wells. Thank you to our critical industry partners f propellants demonstrated in this testing included involved in this development including ASRC Federal LOX/LH2, LOX/GH2, LOX/RP-1, and LOX/LCH4. Astronautics, Additive Manufacturing and Engineering Most chambers were regeneratively-cooled using the (AME), 3DMT, Elementum, Powder Alloy Corporation fuel, while water coolant was used in specific tests to (PAC), ATI, Carpenter, DMG Mori Seiki, RPMI, characterize heat flux environments. DM3D. Thank you to the EM42 team including Ken High duty cycle testing was demonstrated on a SLM Cooper (retired), Zack Jones, Megan Le Corre, Jim GRCop-42 liner, accumulating over 168 starts and 7,400 Lydon, and Brian West. The GRC team including Laura seconds. No signs of blanching or degradation were Evans, David Scannapieco, Bob Carter, Brad Lerch observed, and the liner remained in excellent condition. (retired), Ivan Locci for continued material support of Sustained peak wall temperatures were demonstrated GRCop alloys. We would like to recognize Karen above 727 °C on SLM GRCop-42 liners at MR greater Taminger (Langley), and Virgin Orbit as part of the ACO than 8 for LOX/H2. Similar temperatures were also for bimetallic. We wish to acknowledge the project demonstrated during testing on SLM GRCop-84 offices that continue to push needs for nozzle technology chambers. All hardware performed well and the data and offer leadership, including Steve Wofford, John showed the resilience of the material at these elevated Fikes, Mike Shadoan, and Keegan Jackson, and Lynn wall temperatures with consistent performance Machamer. Also, thank you to the many other engineers throughout test series. Several developmental hot-fire at MSFC and across the agency, commercial space test series demonstrated aggressive conditions with high companies, and industry that engage in technical Pc, MR and subsequent heat loads. The chambers were discussions and that have contributed to these various run aggressively to promote the environment for techniques. potential blanching, but none was observed in the liners. for References AM GRCop-84 and GRCop-42 combustion chambers. Several U.S. vendors have and are being established to [1] Ellis, D.L., GRCop-84: A High-Temperature Copper provide these designs as a commercial printing service Alloy for High-Heat-Flux Applications, hambers as part of 2005-213566. development testing under various programs. l, Comparison of recently demonstrated large-scale SLM of a GRCop-42 GRCop-84 to other Cu alloys with high thermal chamber in an EOS M400 and achieved properties conductivities. J. Mater.Eng. Perform.17, 594 (2008) consistent with the Concept Laser M2 material. Several [3] Ellis, D.L. and G.M. Michal, \"Precipitation large-scale chambers have been fabricated and will be Strengthened High Strength, High Conductivity Cu- tested in the future. Mechanical and thermophysical Cr-Nb Alloys Produced by Chill Block Melt property testing of the SLM GRCop-84 and GRCop-42 Spinning,\" d to develop a design database and Cleveland, OH, (Sept. 1989). IAC-19-C4.3.5x52514 Page 13 of 14 70th International Astronautical Congress (IAC), Washington D.C., United States, 21-25 October 2019. This material is declared a work of the U.S. Government and is not subject to copyright protection in the United States. [4] Ogbuji, L. and Humphrey, D.L., 2003. Comparison as Fabricated by Selective Laser Melting. 2017 Joint of the oxidation rates of some new copper alloys. Nanoscience and Neutron Scattering User Meeting; Oxidation of metals, 60(3-4), pp.271-291. 31 Jul. - 4 Aug. 2017; Oak Ridge, TN; United States [5] Thomas-Ogbuji, L., Humphrey, D.L. and Setlock, [16] Ashby, M.F. and Cebon, D., 1993. Materials J.A., 2003. Oxidation-Reduction Resistance of selection in mechanical design. Le Journal de Advanced Copper Alloys. C7-1. International Symposium on Corrosion Science in the [17] Ashby, M.F., Materials selection in mechanical 21st Century; July 06, 2003 - July 11. Manchester; design. Metallurgia Italiana, 86, (1994). United Kingdom [18] Gradl, P.R., 2016. Rapid Fabrication Techniques for [6] L.U. Thomas-Ogbuji, and D.L. Humphrey: Oxidation Liquid Rocket Channel Wall Nozzles. In 52nd Behavior of GRCop-84 (Cu-8Cr-4Nb) at AIAA/SAE/ASEE Joint Propulsion Conference (p. Intermediate and High Temperatures. Gradl, P., Mireles, O. and Andrews, N., 2018. Intro [7] Donovan, P.C. & Barton, C.J. MT (1973) 4: 1765. to Additive Manufacturing for Propulsion Systems. https://doi.org/10.1007/BF02666209 M18-6849. AIAA Propulsion and Energy [8] Cooper, K. G., Lydon, J. L., Corre, M. D., & Jones, Conference; 9-11 Jul. 2018; Cincinnati, OH. Z. C. (2018). Three-Dimensional Printing GRCop-42 [20] Gradl, P., Brandsmeier, W., Calvert, M., Greene, S., (pp. 1-9) (Unites States, Richard, J. and Morgan, K., Flight Center). Huntsville, AL. verview: propulsion 220129 (2019). applications, design for and lessons learned. [9] Gradl, P., Protz, C., Cooper, K., Garcia, C., Ellis, D., [21] Gradl, P.R., Protz, C.S., Zagorski, K., Doshi, V. and Evans, L., “GRCop-42 Development and Hot-fire McCallum, H., 2019. Additive Manufacturing and Testing using Additive Manufacturing Powder Bed Hot-fire Testing of Bimetallic GRCop-84 and C- Fusion for Channel-Cooled Combustion Chambers”. 18150 Channel-Cooled Combustion Chambers Using Paper presented at 55nd AIAA/SAE/ASEE Joint Powder Bed Fusion and Inconel 625 Hybrid Directed Propulsion Conference, August 2019. Indianapolis, Energy Deposition. In AIAA Propulsion and Energy IN. 2019 Forum (p. 4390). [10] Gradl, P.R., Protz, C., Greene, S.E., Ellis, D., Lerch, [22] Protz, C., Bowman, R., Cooper, K., Fikes, J., B., and Locci., I. \"Development and Hot-fire Testing Taminger, K., Wright, B. Additive Manufacturing of of Additively Manufactured Copper Combustion Low Cost Upper Stage Propulsion Components. Joint Chambers for Liquid Rocket Engine Applications\", Army-Navy-/ASEE Joint Propulsion Conference, Propulsion Subcommittee (LPS) Advanced Materials AIAA Propulsion and Energy Forum, (AIAA 2017- Panel (AMP) Additive Manufacturing for Propulsion 4670) Applications Technical Interchange Meeting (TIM); [11] Gradl, P., Greene, S., Protz, C., Bullard, B., Buzzell, 3-5 Sept. (2014). J., Garcia, C., Wood, J., Osborne, R., Hulka, J. [23] Garcia, C.P., Gradl, P.R., Protz, C.S., Wood, J., and Cooper, K. Additive Manufacturing of Liquid Rocket Greene, S. E., “Characterizing Performance of Engine Combustion Devices: A Summary of Process Additively Manufacturing Regenerative Cooled Developments and Hot-Fire Testing Results. 54th Combustion Chambers through Hot Fire Testing,” AIAA/SAE/ASEE Joint Propulsion Conference, 65th JANNAF Propulsion Meeting/10th Liquid AIAA Propulsion and Energy Forum, (AIAA 2018- Propulsion Subcommittee, May 21-24, 2018. Long 4625). July 9-12, 2018. Cincinnati, OH. Beach, CA. [12] Gradl, P., Mireles, O. and Andrews, N., Introduction [24] Gradl, P.R., Greene, S. E. “Channel Wall Nozzle to Additive Manufacturing for Propulsion Systems. Testing: Test Summary Report for Test Program AIAA Propulsion and Energy Forum 2019. PH034”. polis, IN. August 20 (2019). February 2018. [13] Pells, G. P., and M. Shiga. \"The optical properties of [25] Gradl, P.R., Greene, S. E. “Bimetallic Channel Wall copper and gold as a function of temperature.\" Nozzle Testing: Test Summary Report for Test Journal of Physics C: Solid State Physics 2, no. 10 Program PI100/PJ038”. ter. August 2019. [14] M. F. Ashby: Oxide Dispersion Strengthening, Proc. [26] Gradl, P., Protz, C., Wammen, T. “Additive 2nd Bolton Landing Conf., G.S. Ansell, ed., Gordon Manufacturing Development and Hot-fire Testing of and Breach, New York, NY, 1968, p. 143. Liquid Rocket Channel Wall Nozzles using Blown [15] Minnecci, R., Rawn, C., Jones, Z., Bunn, J. and Powder Directed Energy Deposition Inconel 625 and Tramel, T., 2018. Residual Stress Mapping of As- JBK-75 Alloys”. 55th AIAA/SAE/ASEE P&E Built and Hot Isostatic Pressure Treated GRCop-84 Forum. August 19-22. Indianapolis, IN. (2019). IAC-19-C4.3.5x52514 Page 14 of 14"
]