{
  "paper_id": "1-s2.0-S009457652300334X-main",
  "filename": "1-s2.0-S009457652300334X-main.pdf",
  "pdf_path": "Research_Paper/1-s2.0-S009457652300334X-main.pdf",
  "pages": [
    {
      "page_num": 1,
      "text": "ActaAstronautica211(2023)483–497\nContents lists available at ScienceDirect\nActa Astronautica\njournal homepage: www.elsevier.com/locate/actaastro\nAdvancement of extreme environment additively manufactured alloys for\nnext generation space propulsion applications\nPaul Gradla,*, Omar R. Mirelesa, Colton Katsarelisb, Timothy M. Smithd, Jeff Sowardsb,\nAlison Parkc, Poshou Chene, Darren C. Tinkera, Christopher Protzb, Tom Teasleya,\nDavid L. Ellisd, Christopher Kantzosd\naPropulsion Department, NASA Marshall Space Flight Center, Huntsville, AL, 35812, USA\nbMaterials and Processes Laboratory, NASA Marshall Space Flight Center, Huntsville, AL, 35812, USA\ncNASA Engineering and Safety Center, NASA Langley Research Center, Hampton, VA, 23666, USA\ndHigh Temperature and Smart Alloy Branch, NASA Glenn Research Center, Cleveland, OH, 44135, USA\neJacobs ESSCA Group, NASA Marshall Space Flight Center, Huntsville, AL, 35812, USA\nA R T I C L E I N F O A B S T R A C T\nKeywords: The National Aeronautics and Space Administration (NASA) has been involved in the development and matu-\nAdditive manufacturing ration of metal additive manufacturing (AM) for space applications since the late 2000’s. Several efforts have\nPropulsion focused on the understanding of AM processes through material characterization and testing, standards devel-\nRockets\nopment, component fabrication, and infusion into propulsion development and flight applications. NASA\nAlloy development\nmatured commonly used aerospace alloys from various alloy families (Nickel, Copper, Stainless and Steel,\nGRCop-42\nAluminum, and Titanium-based) through detailed AM process and heat treatment characterization, in addition to\nGRCop-84\nRefractory mechanical and thermophysical testing. While these alloys are actively used in many propulsion applications,\nGRX-810 there is a need for ongoing AM optimized alloys using integrated computational materials engineering (ICME)\nNASA HR-1 and process development for high performance applications. The applications targeted are liquid rocket engines;\nL-PBF advanced propulsion systems; and in-space propulsion with high heat fluxes, high pressure, and/or that use\nLP-DED propellants that can degrade alloys (e.g., hydrogen). This paper highlights the characterization and physical\nDED properties of the more common AM alloys using laser powder bed fusion (L-PBF) and laser powder directed\nLaser powder bed fusion\nenergy deposition (LP-DED) processes. Additionally, this paper discusses some of the ongoing novel alloy\nLaser powder directed energy deposition\ndevelopment and maturation using AM for use in these harsh environments, such as GRCop-42, GRCop-84, NASA\nHR-1, GRX-810, and C-103. The results from these processes demonstrated that AM could enable rapid devel-\nopment, and that optimized alloys could be developed using ICME, yielding higher performances. These alloys\nhave undergone modeling, fundamental metallurgical evaluations, heat treatment studies, detailed microstruc-\nture characterization, and mechanical testing campaigns. This, combined with direct application-specific\ncomponent fabrication and hot-fire testing, enabled the increase of the Technology Readiness Level (TRL)\nthrough high duty-cycle testing. A background and overview of these novel AM-enabled alloys and AM pro-\ncessing developments including metallurgical and mechanical property studies is presented here. The latest\nadvancement in the parallel component development and hot-fire testing and future developments for these\nalloys is also discussed.\neconomics, and acceptable risk [1]. The appropriate selection, utiliza-\n1. Introduction tion of metal alloys, and their processing throughout the entire\ncomponent life cycle have a substantial impact on the success of the\nMaterial selection for an end-use aerospace application is critical for components once they are put into service. [2]. Propulsion components\nboth component and mission success. Aerospace propulsion components are typically designed with minimal margins to reduce mass, so a\nprovide unique challenges due to the demanding end-use environments thorough understanding of the material behavior under the expected\nin addition to programmatic and system requirements to meet mass, operating conditions and environment is critical. While various\n* Corresponding author.\nE-mail address: Paul.R.Gradl@nasa.gov (P. Gradl).\nhttps://doi.org/10.1016/j.actaastro.2023.06.035\nReceived 5 January 2023; Received in revised form 7 May 2023; Accepted 19 June 2023\nAvailableonline28June2023\n0094-5765/PublishedbyElsevierLtdonbehalfofIAA.ThisisanopenaccessarticleundertheCCBYlicense(http://creativecommons.org/licenses/by/4.0/).",
      "tables": []
    },
    {
      "page_num": 2,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nAcronyms/Abbreviations LP-DED Laser Directed Energy Deposition\nLRE Liquid Rocket Engine\nAM Additive Manufacturing MTD Manufacturing Technology Demonstrator\nCDS Carbide Dispersion Strengthened NASA National Aeronautics and Space Administration\nDED Directed Energy Deposition NTP Nuclear Thermal Propulsion\nDOD or FOD Domestic or Foreign Object Debris ODS Oxide Dispersion Strengthened\nHEE Hydrogen Environment Embrittlement PBF Powder Bed Fusion\nHEI Hydrogen Embrittlement Index RCS Reaction Control System\nHIP Hot Isostatic Pressing RHEA Refractory High Entropy Alloys\nICME Integrated Computational Materials Engineering TRL Technology Readiness Level\nLCF Low Cycle Fatigue UTS Ultimate Tensile Strength\nL-PBF Laser Powder Bed Fusion\nmaterials are used for propulsion components, metals and metal alloys over traditional methods and allows for regular and early developmental\nare the most common. They often come from alloy families including manufacturing and testing to iterate designs. Cost reduction has been\naluminum-, stainless steel, titanium-, nickel- and iron-based superalloys, continuously demonstrated using AM for complex components on the\ncopper-, refractory-, and platinum-based alloys [3]. order of 50% or greater. To achieve these gains, AM must be applied\nThe metals and metal alloys used for propulsion applications must intentionally and methodically to obtain potential technical and eco-\nmeet a long list of technical requirements in addition to satisfying pro- nomic advantages with strong consideration of the alloy being used.\ngrammatic goals. These requirements often include high strength-to- While AM has shown advantages for cost and schedule reductions, it also\nweight ratios, capacity to operate cyclical and sustained static and dy- offers new opportunities to alloy for higher performance alloys.\nnamic loads (i.e., long-life duty cycles), chemical compatibility with AM maturation started with a limited number of commonly available\nfuels and/or oxidizers, the ability to withstand both cryogenic ((cid:0) 253 ◦C) alloys – Ti6Al4V, AlSi10Mg, Inconel 625, Inconel 718, CoCr, and 316 L\nand elevated temperatures (often >1000 ◦C), and to have thermal stainless steel for example [1,3]. This led designers to use what was\nexpansion coefficients equivalent to alloys to which they are mated or available, but not always what provided the optimal design solution.\njoined. These requirements stem from harsh operating of modern liquid Propulsion applications tend to be more risk-sensitive, so a design may\nrocket engines where chamber temperatures can exceed 3300 ◦C and lean towards the selection of common, accessible, and well-matured AM\nwhere the chamber and coolant pressures exceed 410 bar. Programmatic alloys over a new an AM alloy that needs to be developed, characterized,\ngoals that generally enforce weight minimization and associated per- and matured [4]. As many AM processes have become standardized and\nformance requirements can result in thin walls (<1 mm) that must more widely accepted, the adoption of new alloys for AM may readily\nwithstand high heat flux. The combination of harsh chamber conditions occur with a greatly reduced developmental cycle per material. NASA\nand thin hot walls results in high thermal gradients often exceeding specifically identified this need for various propulsion applications as\n230 ◦C through the wall, inducing high thermal stresses. In addition to well as the gap to develop and mature new alloys using AM processes. A\ndemanding high performing tensile and fatigue properties, fracture specific goal in new alloy development was not only to increase the\ntoughness is essential due to potential impacts from domestic or foreign end-use alloy performance, but also ensure robust printing to eliminate\nobject debris (DOD or FOD). Depending on the environment corrosion issues that can arise during traditional manufacturing. Having the\nresistance and wear resistance may also be required. Other environ- choice of new alloys that are intentionally enabled by AM could provide\nmental factors such as radiation, atomic oxygen, ultraviolet, or plasma many benefits: expanded design options, improved product perfor-\nmay also place additional requirements on the properties required for a mance, and reduced post-processing costs. NASA has advanced AM al-\nmaterial. The operating environment thus drives the desired properties loys to meet end-use environments under alloy families such as copper,\nfor an alloy including mechanical, physical and thermophysical. These Fe–Ni, high temperature superalloys (i.e., ODS), and refractories. Each\nproperties are derived from the interconnection between the process- of these alloys has different target use applications and developed per\nmicrostructure-properties ultimately leading to end-use performance. requirements described previously. Alloys discussed in this paper\nVarious traditional manufacturing processes and techniques for include GRCop-42 (Cu-4 at.% Cr-2 at.% Nb) and GRCop-84 (Cu-8 at.%\naerospace components are well-matured and the alloys produced from Cr-4 at.% Nb), NASA HR-1 (Fe–Ni–Cr), JBK-75 (Fe–Ni–Cr), GRX-810\nthese processes well-characterized to produce flight components. These (NiCoCr), C-103 (Nb-10 wt%, Hf-1wt.%, Ti), Tungsten (W), and Mo-\nprocesses can include forgings, castings, machining, welding, brazing, lybdenum. The use temperature and purpose of these custom alloys is\ninspections, heat treatment, and other assembly operations to fabricate shown in Table 1. The unique category of oxide dispersion strengthened\nthe final component and system. The manufacturability and sequence of (ODS) nickels use a nanoscale oxide such as yttria (Y2O3), zirconia\noperations (including supply chain and processing economics) are (ZrO2), or thoria (ThO2) for strength and creep improvements.\nnecessary considerations for component and system designs but can lead Several of these alloys have roots using traditional techniques but\nto long lead times and cost increases. Additionally, propulsion compo- were not advanced due to challenges with production in the wrought\nnents are often produced in low volumes (<100 units) and specialty form or economic reasons. In fact, alloys such as NASA HR-1 were\nprocess development can be costly if not fully amortized. While design developed using wrought and traditional processes then shelved for 15\nand integration of components and system is arduous, the years. AM has brought about rapid development with a reduced supply\nmanufacturing stage is when most of the program problems arise. There chain and build process schedule. This has revived interest in previously\nare opportunities to improve or replace the existing manufacturing difficult-to-process alloys or new alloys only enabled by AM. The alloys\ntechniques to reduce costs and eliminate non-conformances. In addition described in this paper fill several gaps for materials needed in liquid\nto improving or replacing the manufacturing processes, there are op- rocket engine environments including hydrogen resistance, high pres-\nportunities for new alloys to enable higher performance. sure environments, extreme temperatures, creep resistance, and a\nAdditive Manufacturing (AM) has matured rapidly for use in pro- combination thereof. This paper describes the importance of each of\npulsion systems with many components in both flight and in develop- these AM alloys for propulsion, the development work completed on\nmental applications. AM has demonstrated schedule savings of 2–10x these including the formulation, AM build processes, characterization,\n484",
      "tables": []
    },
    {
      "page_num": 3,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nTable 1 head is attached to a gantry or robotic motion control and defined\nSpecialty AM alloys developed with different purposes for propulsion toolpath from the part CAD geometry. A local purge or fully inert build\ncomponents. chamber is used to reduce oxygen and a trunnion table is typical of the\nMax. Use Alloy Purpose Novel AM Propulsion motion control system allowing for multiple axis orientations for part\nTemp. Family Alloys Use deposition. The hydrogen-resistant NASA HR-1 and JBK-75 alloys were\n(◦C)\ntargeted for use with the LP-DED allowing for large scale integral\n200 Aluminum Lightweighting – Various channel wall rocket nozzles to be built. GRCop-42 and C-103 have also\n750 Copper High conductivity; GRCop-42, Combustion been built using the LP-DED process and plans are in place for GRX-810\nstrength at GRCop-84 Chambers LP-DED development.\ntemperature\n800 Iron–Nickel High strength and NASA HR- Nozzles, AM build process selection is critical for parts to be produced suc-\nhydrogen resistance 1 Powerheads cessfully and for fully realizing economic benefits offered by AM. This\n900 Nickel High strength-to- – Injectors, was previously discussed in a detailed paper [3]. Attributes that can\nweight Turbines discriminate between the processes include overall part size, part\n1100 ODS Nickel High strength at GRX-810, Injectors,\ncomplexity, feature resolution, process economics and availability, in-\nelevated temp; Alloy 718- Turbines\nreduced creep ODS dustrial maturity, post-processing, and metallurgical characteristics and\n1850 Refractory Extreme temperature C-103, C- Uncooled properties. A typical input prior to process selection is the type of alloy.\n103-CDS, Chambers Each AM process has unique attributes and not all the novel alloys can be\nMo, W built using all the AM processes. Feedstock is an important discriminator\nas well. The alloys defined in this paper are readily available as a powder\nheat treatment optimization, microstructure characterization, mechan- feedstock and are the most economical source for AM processes.\nical and thermophysical testing, and hot-fire testing. Proper maturation GRCop-42 and GRCop-84 require gas atomization using argon to form\nof the alloys requires a thorough understanding of the entire AM life the chromium-niobium in suspension for the dispersion strengthening\ncycle from component conceptual design through end-use service life to [6]. NASA HR-1 and JBK-75 are produced using rotary atomization but\nsuccessfully implement. can be produced using gas atomization [7]. C-103 and GRX-810 also use\ngas atomization. GRX-810, ODS, and carbide dispersion strengthened\n2. AM processes and development (CDS) family of alloys all require a coating process for the powder\nfollowing atomization [8].\n2.1. AM processing life cycle\n2.2. ICME modeling for novel alloys\nThe AM life cycle is inclusive of various steps that include the design\nand analysis of the part and build, the AM build processes with inputs Integrated Computational Materials Engineering (ICME) is a trans-\nincluding feedstock and build parameters, post-processing, and finally formative discipline that enables rapid materials development through\nverification and certification before the part is placed into service [3]. computational methods that integrate materials information with pro-\nPost-processing may include operations such as powder removal, sup- cessing and performance [9]. Infusion of ICME into AM workflows\nport removal, build plate removal, heat treatments (i.e., stress relief, hot provides numerous benefits such as rapid maturation of AM processed\nisostatic pressing (HIP), solution, aging, etc.), cleaning, inspections, alloys from the initial formulation through development to production\nmachining, polishing, and joining. Since the AM process is tightly inte- of flight-certified parts [10]. ICME approaches are experiencing broad\ngrated through all process steps, there are many opportunities where adoption, extending beyond their traditional role as academic tools,\ndefects can manifest or improper order of operations that can reduce primarily due to the reduction in the material maturation cycle. NASA is\nperformance. The manufacturing process derived for AM is much more using such approaches to develop new alloys with optimal 3D printing\nthan just printing the part. The successful development of new AM alloys characteristics including printability of new refractory alloys and\nintegrates all the above steps. enhanced mechanical performance of oxide dispersion strengthened\nVarious AM processes have been matured to produce the NASA AM nickel-based alloys. Two examples on the usage of ICME at NASA centers\nalloys for specific component applications [5]. The AM processes are for the development of such materials is described here.\ncategorized into melting processes and solid-state processes. Each has A first example of ICME implementation at NASA is the circumven-\nunique advantages and challenges, and many are supplemental to one tion of difficulty and expense associated with conventional refractory\nanother. The most commonly used AM processes to produce components metal manufacturing methods. Under conventional manufacturing\nare categorized into powder bed fusion (PBF) and directed energy methodologies, refractory metal and alloy bar, plate, tube, and sheet are\ndeposition (DED). The PBF process, specifically laser powder bed fusion fabricated through various forming and joining cycles leading to diffi-\n(L-PBF) manufactures parts using a bed of powder and a laser as the culties with machining a hard material, difficulty in producing defect-\nenergy source. The laser melts the powder in a defined scanning strategy free joints, and high expense and material waste of high-value stocks.\nto create features within a discrete layer. The build chamber is fully Additive manufacturing can mitigate much of the waste and expense but\npurged and a recoater arm provides a new layer of powder to be melted requires refractory metal and alloy feedstocks that are printable (resis-\nin a layer-by-layer operation to build a complete component. L-PBF is tant to formation of build defects). There is opportunity to reexamine the\nmost often used for fine feature components but is limited in overall refractory metal alloy space using computational approaches combined\nbuild volume. GRCop-42, GRCop-84, GRX-810, C-103 all made use of with limited empirical validation to develop new printable alloys in the\nL-PBF since these alloys are used in components that require small W, Nb, Mo, and Ta families.\nfeature resolution such as combustion chambers and injectors. Several metallurgical issues arise during printing of such materials:\nAnother AM process used to manufacture custom NASA alloys is 1) solidification cracks occur during terminal stages of alloy solidifica-\nDED, which has several variations based on feedstock and energy source tion, 2) large grain formation due to epitaxial growth and thermally\n(i.e., laser, electron beam, electrical arc). The most common DED activated grain growth, and 3) a shift in ductile-to-brittle behavior to\nmethod is laser powder directed energy deposition (LP-DED) providing temperatures at or above the build temperature resulting in cracks as the\nmedium resolution features, but exceptionally large build volumes. LP- grain size increases. The approach to mitigate these issues is through\nDED uses a deposition head equipped with off-axis or coaxial nozzles, inoculation of powder feedstocks with high melting point intermetallic\nwhich blow powder into a melt pool formed by a laser. This deposition particles (examples include ZrC, TaC, HfC), which are optimized in size\nand distribution to pin grain boundaries thereby preventing grain\n485",
      "tables": []
    },
    {
      "page_num": 4,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\ngrowth and associated embrittlement. Addition of these particles alters\nthe solidification behavior and can unfortunately promote solidification\ncracking during the build. ICME tools (including CALPHAD and custom\nPython routines for solidification crack modeling and particle coars-\nening) are used to find regions of optimal powder addition where grain\ngrowth and solidification cracking are both minimized. Fig. 1 shows an\nexample of hundreds of solidification cracking and particle coarsening\nsimulations of the W–Zr–C ternary system, mapping out regions of\ncracking susceptibility. Darker contours suggest compositions where a\nnew alloy would be most crack-resistant and lighter contours suggest\ncompositions expected to be most crack susceptible. To map this space\nempirically would require hundreds of powders to be formulated and\nprinted which is unequivocally cost prohibitive. Yet with ICME, the\ncomposition space can be mapped on a workstation in less than 24 h, and Fig. 2. Predicted phase stability of GRX-810 between 800–1500◦ C. No\nthen validate computed findings empirically with a few select data detrimental phase formation is predicted above 810◦C.\npoints to guide production of future W and W-alloy powders using the\ninoculant addition approach. composition spaces with a desired performance metric and optimize\nA second example involves promising results from NiCoCr ODS alloy chemistry. Such techniques are being slowly adopted for propulsion\nproduction using L-PBF at the NASA [8]. CALPHAD modeling was applications. There is still tremendous opportunity available to infuse\nemployed to produce a new ODS composition utilizing the equiatomic ICME into development cycles for next generation space propulsion\nNiCoCr system as the foundational base chemistry. From these simula- alloys.\ntions a few notable findings were made. It was evident that Mo additions\ntypically stabilized unwanted phases (e.g., σ, μ) and the ratio of Ti to Nb 3. Maturation of alloys for propulsion\nwas critical for the stabilization of MC carbides especially at 1093 ◦C.\nPrevious ODS alloys developed for AM indicated that grain boundary 3.1. Alloy selection for propulsion components\noxidation played a significant role in ultimate tensile strength and\nductility variations. In turn, MC carbides were targeted to improve grain Each component in a liquid rocket engine system must complete a\nboundary strengthening and oxidation resistance [11]. The solid solu- methodical trade to determine the appropriate alloy requirements based\ntion strengthening was targeted for improvement from existing Ni-based on the environment, system loads, and life requirements. Combustion\nalloys while maintaining phase stability up to and at the target test chambers operate at high heat fluxes from the combustion process and\ntemperature of 1093 ◦C. The freezing range was targeted to remain are most often actively cooled using the propellants (generally fuel) to\nunder 100 ◦C. Certain elements had unexpectedly large impacts on the maintain reasonable wall temperatures and avoid melting [12].\nfreezing range and were assumed as unwanted additions for an alloy Copper-alloys are often used due to the high conductivity and strength at\ndesigned for printability. Unwanted phases, namely σ and μ, were wall temperatures that can exceed 750 ◦C [13]. Low cycle fatigue (LCF)\neffectively suppressed as low as 810 ◦C, hence the alloy was named is often a key consideration as chambers must survive multiple starts and\nGRX-810. The simulations suggested this new composition had the best sustained duty cycles for reusability. Due to the environment from the\nbalance between printability, strength, oxidation resistance, and pha- propellants, oxidation can lead to blanching, and hydrogen can cause\nse/microstructure stability. Fig. 2 reveals the amount of each phase in hydrogen environment embrittlement [14]. NASA has matured\nthe temperature range 800–1500 ◦C, as predicted by the thermodynamic GRCop-42 and GRCop-84 to meet these requirements. The Glenn\nmodel for GRX-810. Research Center Copper- (GRCop-) alloys were developed as a high\nBoth examples above provide a snapshot of thousands of virtual strength and high conductivity alternative to other commonly used\nexperiments that were enabled by ICME approaches. There is no need to copper-alloys such as C-18150 (Cu–1.5 wt% Cr–0.2 wt% Zr), NARloy-Z\ncreate hundreds of new powder lots, fabricate thousands of samples, and (Cu-3 wt.% Ag-0.5 wt% Zr), Glidcop-15 (Cu-0.15 wt% Al2O3), and\nthen perform extensive material evaluations. Instead, commercial off- C-18200 (Cu–1.2 wt% Cr).\nthe-shelf and custom codes may be used to rapidly screen large A general comparison of the copper-alloys is shown in Fig. 3\ncomparing conductivity with yield strength at elevated temperature\n(600 ◦C). A single plot is often difficult to capture the entire material\ntrade since only two of the criteria are shown and can also change at\nelevated temperatures or different conditions. For instance, pure copper\nis limited to approximately 200 ◦C before it reaches a significant\nreduction in strength. Other copper alloys such as C-18150 and C-18200\nare generally limited to nominal operating temperatures of around\n540 ◦C due to reduced strength or changes in thermal properties due to\nthe sustained temperatures.\nAnother key component in a liquid rocket engine is the exhaust\nnozzle, which is typically regeneratively-cooled (regen) due to the high\nheat flux. The joint between the chamber and nozzle is appropriately\nselected to balance the heat flux with minimizing overall system weight.\nWhile the chamber uses copper-alloys for high conductivity, the regen\nnozzle is made from a higher strength-to-weight alloy, typically a\nstainless steel or superalloy. The NASA HR-1 was specifically developed\nfor regen nozzle applications using hydrogen as a propellant, allowing\nfor hydrogen resistance which otherwise causes hydrogen environment\nembrittlement (HEE) issues. The NASA HR-1 variant for AM applications\nFig. 1. Calculated solidification cracking susceptibility of the W–Zr–C ternary was specifically formulated for high ultimate strength, yield strength,\nsystem. Dark contours represent regions of lowest cracking susceptibility.\n486",
      "tables": []
    },
    {
      "page_num": 5,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nvery low HEI along with a high ultimate tensile strength (UTS) at 600 ◦C.\nThis is a typical operating temperature for the NASA HR-1 alloy for\nregen nozzles, but nozzle operating temperatures can exceed this tem-\nperature based on the environment and engine requirements. Other al-\nloys such as 316 L can meet the HEI requirement, but with a significant\nreduction in strength. Superalloys such as Alloy 625 (Inconel 625) and\nAlloy 718 (Inconel 718) can be used in this environment but will require\na significant reduction in material properties and frequent inspections to\naccount for the HEE. NASA HR-1 offers an excellent balance of the high\nstrength, HEE resistance, LCF life, thermal conductivity, and ductility to\nmeet the channel-cooled nozzle requirements for engines using\nhydrogen or other propellants (i.e., methane, liquid natural gas).\nPropulsion components such as rocket injectors, nozzles, turbine\nblades, combustors, and other hot section components operate at\nelevated temperatures for sustained durations and multiple engine\nstarts. Typically Ni-based superalloys are used in these environments but\nare generally limited to 900 ◦C or less in most cases for sustained\noperation. While γ′ precipitate strengthened Ni-alloys can sustain some\nminimal mechanical properties at temperatures up to 1200 ◦C, this is not\na realistic design temperature for this type of material. This can limit the\nperformance of these components and the overall system may not be\noptimized due to temperature limits in a turbine or injector faceplate.\nOther challenges with current components include creep rupture, which\nis a necessary design consideration for sustained durations and high duty\ncycles such as those for aircraft engines.\nFig. 3. Comparison plot of copper-alloy selection based on conductivity\nand yield strength at 600◦C. Data compiled from Refs. [15–17]. GRX-810 (Glenn Research Center eXtreme) alloy was developed and\nis being further matured to allow an increase in operating temperatures\nfor these various components. The alloy is Ni–Co–Cr-based and in-\nand elongation in this environment and superior weldability, which\ncorporates ODS coating of the powder to allow the high performance at\ntranslates into good printability. LCF is also a strong consideration in the\nelevated temperature. Traditionally manufactured ODS alloys were\nnozzle design since it is tested and flown for multiple starts and missions.\nplagued with high expenses due to the manufacturing process [18], but\nThe conductivity was also improved in the LP-DED version of the alloy\nAM is enabling more economical high performance ODS alloys, like\ncompared to the wrought version to aid with the design for nozzles.\nGRX-810, to be produced. It is also enabling for high-complexity ODS\nA comparison plot is shown in Fig. 4 for various superalloys, stainless\nalloy components such as injectors.\nsteel alloys and NASA HR-1 with the hydrogen embrittlement index\nWhile operating temperatures and creep are a couple of consider-\n(HEI) along with the ultimate strength at elevated temperature. While\nations, the mechanical properties such as ultimate and yield as well as\nalmost no metals are fully resistant to hydrogen, HEI values below about\nphysical properties such as density need to be considered for optimal\n20% are not as susceptible to embrittlement. The NASA HR-1 shows a\ndesigns. The GRX-810 alloy compared to other superalloys and ODS\nsuperalloys is shown in Fig. 5. For reference, AM Ni–Co–Cr using L-PBF\nis also shown on the same graph but is without the yttria addition pre-\nsent in GRX-810. The strength of the GRX-810 with the ODS nearly\ndoubles the strength at temperature. An additional advantage of ODS\nalloys includes improved oxidation properties at elevated temperatures\nby promoting and stabilizing Alumina or Chromia oxide scale formation\n[19]. The creep rupture life of GRX-810 increases orders of magnitude\nover more traditional Ni-based superalloys such as Alloy 625 and Alloy\n718 at 1093 ◦C based on testing at NASA Glenn Research Center [20].\nRefractory metals such as Niobium (Nb), Molybdenum (Mo),\nTantalum (Ta), Rhenium (Re), and Tungsten (W) and their alloys are\nused for extreme high temperature environment service. Refractory\nmetals are desirable due to a high melt temperature (Tm) and the ability\nto retain strength and hardness at elevated temperatures, but with the\nexception of Nb, they have higher densities than Ni-base superalloys\n[21]. Examples of applications include in-space radiatively cooled\nthrusters, reaction control system (RCS) thrusters, nuclear thermal\npropulsion (NTP) fuel and structure, hypergolic and green propulsion\nchambers, nuclear power system in-core heat pipes and heat exchangers,\nelectric propulsion, and plasma facing components in fusion reactors.\nRefractory metals and alloys extend the operating temperature to be-\ntween 1100 and 2500 ◦C, depending on the selected material, as shown\nin the red bullets in Fig. 6. Selection of a specific metal or alloy is highly\ndependent on expected operating conditions including temperature,\nenvironment (i.e., oxidizing, reducing, inert, vacuum), stresses, neutron\nFig. 4. Comparison plot of NASA HR-1, superalloys, and stainless alloys fluence, etc.\ncomparing the hydrogen embrittlement index (higher HEI =more susceptible)\nto ultimate strength at 600 ◦C.\n487",
      "tables": []
    },
    {
      "page_num": 6,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nFig. 5. Comparison of ultimate tensile strength at elevated temperature (1093 ◦C) with density for GRX-810 and other ODS alloys as well as Ni-based superalloys.\nTable 2\nChemistry of GRCop-42 and GRCop-84.\nElement GRCop-42 wt % GRCop-84 wt %\nCu Balance Balance\nCr 3.1–3.4 6.2–6.8\nNb 2.7–3.0 5.4–6.0\nFe Target <50 ppm Target <50 ppm\nO Target <250 ppm Target <250 ppm\nAl Target <100 ppm Target <100 ppm\nSi Target <100 ppm Target <100 ppm\nCr:Nb Ratio, wt. % 1.13–1.18 1.13–1.18\nstrength and good LCF properties, there was a desire to improve the\nthermal conductivity. NASA started L-PBF development of GRCop-42 in\n2018 to mature the alloy through development of material properties,\ncomponent demonstrations, and hot-fire testing. A critical task in\ndeveloping these alloys were the establishment of the powder supply\nchain and commercial print services to permit accessibility of the GRCop\nalloys for commercial space use. As of 2023, more than eight interna-\ntional vendors are actively producing the GRCop powder and more than\n12 commercial print services providing this as a standard material\noption.\nAn extensive effort was established to develop properties related to\nthe GRCop alloys and to make these accessible to industry. Due to the\ndispersion strengthening, the GRCop alloys do not require heat treat-\nFig. 6. Refractory elemental density compared to melting point at 1 atm.\nment. Only a HIP is required to achieve full density. The typical tensile\nstrengths as a function of temperature for L-PBF GRCop-42 and GRCop-\n4. High conductivity GRCop-42 and GRCop-84\n84 is shown in Fig. 7. Advantages of GRCop alloys are high conductivity,\ngood strength at elevated temperatures, and stability during operation\nThe GRCop alloys are dispersion strengthened through Cr2Nb pre-\n[26]. The GRCop-84 has demonstrated higher strength at various tem-\ncipitates created during the powder atomization and refined during L-\nperatures due to the higher content of Cr2Nb and slightly improved low\nPBF processing [22]. The GRCop alloys were specifically formulated for\ncycle fatigue properties. The advantage of the GRCop-42 alloy is a\nhigh strength at temperature, HEE resistance, high conductivity, and 15–20% higher thermal conductivity as shown in Fig. 8.\nlong low-cycle fatigue (LCF) lives. The chemical composition for\nNASA has utilized GRCop alloys in the manufacturing and testing of\nGRCop-42 and GRCop-84 is shown in Table 2. The GRCop alloys also over 60+ combustion device components. The commercial space in-\nhave improved oxidation and blanching resistance competed to most\ndustry is also making use of GRCop-42 in development and flight ap-\nlow-alloy Cu-based alloys [23,24]. GRCop alloys allow hot wall tem-\nplications. These include channel-cooled chambers, injectors, and\nperatures of ≥700 ◦C depending upon the strength, creep, and LCF\nignition systems using L-PBF. Additional development work has been\nrequirements.\ncompleted using the LP-DED process, but no components have been\nIn 2014, NASA started development of the L-PBF process for GRCop-\ntested using this process as of this publication. NASA has successfully\n84 under the Low-Cost Upper Stage Program (LCSUP) and successfully\nhot-fire validated chambers at over 1200 starts and greater than 45,000\nbuilt and hot-fire tested various chambers. Material and property char-\ns of cumulative duration as of this publication. One GRCop-42 L-PBF\nacterizations were also performed [25]. While the GRCop-84 had high\nchamber was successfully tested with over 10,000 s and 293 starts, and a\n488",
      "tables": []
    },
    {
      "page_num": 7,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nFig. 7. Typical average ultimate tensile and yield strength vs. temperature for\nL-PBF GRCop-42 and GRCop-84 alloys.\nFig. 9. Development and hot-fire testing of GRCop-alloy chambers. A) Hot-fire\ntesting of a 31 kN LOX/CH4 lander GRCop-42 chamber for 51 cycles, B) Pol-\nished GRCop-42 chamber, C) Bimetallic chamber using L-PBF GRCop-42 liner\nand NASA HR-1 LP-DED jacket.\nGRCop alloys has been found to be extensive. L-PBF of GRCop alloys has\nbeen demonstrated for custom and complex designs to balance heat\ntransfer and friction factors (pressure drop). Customization of surface\nroughness, waviness, and porosity in the L-PBF process allows engineers\na broader trade space for liquid rocket engine design. High porosity\nallows production of transpiration features for active cooling of com-\nponents such as an injector faceplate. Surface roughness reductions or\nincreases allow for the customization of the desired engine heat load\nbalanced with increasing or decreasing friction factors within the\nchamber channels. This impacts downstream component performance\nsuch as injector combustion efficiency by controlling coolant exit tem-\nperature and turbopump power requirements. Lastly, while oxygen\ncompatibility of GRCop alloys has not been quantified, observations\nfrom hot-fire testing suggests high tolerance to oxygen rich combustion\nFig. 8. Average conductivity vs. temperature for L-PBF GRCop-42 and\nenvironments.\nGRCop-84.\nAdditional development using GRCop alloys has been demonstrated\nusing multiple alloys with various AM processes (bimetallic or multi-\nsecond chamber achieved over 7400 s and over 168 starts. GRCop alloys\nmetallic). This has allowed for the high conductivity and high strength\nhave also enabled the development and long-duration testing of new\nGRCop liner and a higher strength-to-weight alloy, such as Alloy 625 or\npropulsion concepts such as Rotating Detonation Rocket Engines\nNASA HR-1 to be used as a structural jacket. Additional development\n(RDRE) [27]. These statistics demonstrate the robustness and versatility\nunder NASA’s Rapid Analysis and Manufacturing Propulsion Technol-\nof the GRCop alloys. No damage to the chambers from blanching or\nogy (RAMPT) project using axial bimetallic methods with GRCop-42\ncracks were observed. NASA has completed testing in Liquid Oxygen/-\nhave enabled larger thrust chamber assemblies with multiple alloys\nHydrogen (LOX/H2), LOX/Kerosene (LOX/RP-1), and LOX/Methane\nand elimination of a bolted joint between the chamber and nozzle [28].\n(LOX/CH4) using various GRCop-42 and GRCop-84 chambers. Examples\nNASA has designed, produced, and tested GRCop alloy calorimetry\nof hot-fire testing and development chamber units are shown in Fig. 9.\nchambers. These chambers have provided heat flux profiles for constant\nFurthermore, the potential for rocket propulsion applications using\n489",
      "tables": []
    },
    {
      "page_num": 8,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\npressure and rotating detonative combustion devices (i.e., RDRE) [29, Table 3\n30]. GRCop alloys provided the properties to enable these high heat flux Nominal chemical composition for AM NASA HR-1.\napplications. The versatility of GRCop alloys is substantial, and an in- Element NASA HR-1 Rev 3 wt% Range NASA HR-1 Rev 3 wt% Target\nvestment NASA will continue exploring along with commercial partners.\nFe BAL 41.2\nThe powder production process and L-PBF process parameters have Ni 33.7–34.3 34\nbeen fully commercialized and are in use across the propulsion industry. Cr 14.3–14.9 14.6\nDevelopment has also started using LP-DED to build parts with infrared Mo 1.6–2.0 1.8\nand green wavelength lasers for monolithic and bimetallic components. V 0.28–0.32 0.3\nW 1.4–1.8 1.6\nAn example of demonstrator chambers using GRCop-42 and GRCop-42/\nCo 3.6–4.0 3.8\nAlloy 625 green laser LP-DED manufacturing technology is shown in Ti 2.2–2.6 2.4\nFig. 10. Al 0.23–0.27 0.25\n5. Hydrogen resistant NASA HR-1\nto moderately decrease strength of the LP-DED alloy while improving\nNASA HR-1 is a high strength Fe–Ni based γ′-strengthened superalloy the ductility, LCF life, and HEE resistance from the initial composition\ntested in LP-DED [34].\ndesigned to resist high pressure hydrogen environment embrittlement\nSignificant development of heat treatments and material character-\n(HEE), oxidation, and corrosion [2]. NASA HR-1 was originally derived\nization for LP-DED NASA HR-1 began in 2019 to understand and opti-\nfrom JBK-75 for increased strength and ductility in high-pressure\nmize the microstructure of LP-DED NASA HR-1 [3]. Upon discovery of Ti\nhydrogen environments to meet the requirements of liquid rocket en-\nsegregation and η-phase problems, the subsequent powder composition\ngine (LRE) applications. NASA HR-1 was developed to maximize yield\nadjustments also required further adjustments to heat treatments to\nstrength, thermal conductivity, ductility, and LCF while minimizing HEE\nmitigate η-phase as it can severely impact the HEE resistance of NASA\nresistance. To achieve this, the chemical composition of NASA HR-1\nincreased γ′ forming elements (Ti and Al), added W and Co, and HR-1 [4]. Changes to the stress relief, homogenization, and solution\ntreatment times and temperatures helped to minimize Ti segregation\nadjusted the Fe and Ni content [31]. Wrought NASA HR-1 requires costly\ndue to the LP-DED process, and the aging cycle was changed from a\nand tedious processing that was not economically feasible for LRE\n1-step to a 2-step age at as this was observed to mitigate η-phase while\ncomponents. However, powder AM processes, such as LP-DED, have\nminimizing the yield strength drop and improving ductility [5].\nenabled NASA HR-1 to be a more affordable alloy for LRE applications.\nOnce the heat treatments were determined, efforts focused on\nWhile adapting NASA HR-1 to the LP-DED process, it was discovered\ncharacterizing the mechanical and thermophysical properties of NASA\nthat the LP-DED process promotes Ti segregation and formation of\ndetrimental η-phase more than the conventional wrought process [32, HR-1. Tensile and low cycle fatigue have been tested across a range of\ntemperatures and testing has been performed in pressurized gaseous\n33]. As a result, the composition of NASA HR-1 was modified to the final\nHydrogen (GH2) environments to assess the HEE resistance of LP-DED\nAM variant revision shown in Table 3. The changes made were expected\nNASA HR-1 [35]. The ultimate tensile strength of various LP-DED al-\nloys compared to NASA HR-1 is shown in Fig. 11. Using either the 1-step\nage for higher strength or the 2-step age for more ductility, NASA HR-1\nperforms between alloys 718 and 625. Compared to wrought NASA\nHR-1, LP-DED NASA HR-1 has lower strength but higher ductility\nshowing one of many differences between wrought and AM materials\n[5]. Additionally, LCF testing has shown that LP-DED NASA HR-1 per-\nforms well across temperatures ranging from (cid:0) 196 ◦C to 760 ◦C (Fig. 12)\nFig. 10. Manufacturing demonstrator chambers using A) GRCop-42 and B)\nGRCop-42/Alloy 625 LP-DED green laser. [Courtesy: RPMI/TRUMPF/NASA]. Fig. 11. Average ultimate tensile strength of LP-DED alloys versus temperature.\n490",
      "tables": []
    },
    {
      "page_num": 9,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\ncombustion device components targeting channel wall nozzles. The LP-\nDED process has shown robustness to produce large structures with in-\ntegral coolant channels as well as thicker wall components for forging\nand casting replacements. Various parameters and corresponding laser\nmelt pools can be varied to allow for different features. A lower power\nallows for thin walls to be deposited at 1-mm thickness for channel wall\nnozzles [37]. The higher power increases the deposition rates for thicker\nwall components that are often final machined and have limited internal\nfeatures. The components demonstrated include powerhead half shells\n(i.e., for the RS-25 Engine’s powerhead), manifolds for nozzles and\nchambers, transfer tubes, domes, and other pressure loaded components\nthat are used in hydrogen environments. The LP-DED process was also\nused to build a manufacturing technology demonstrator (MTD) at 1.52\nm diameter and 1.78 m height, approximately a 65% scale RS-25\nchannel wall nozzle (Fig. 14).\nNASA has completed several test campaigns to demonstrate nozzles\nmanufactured using the NASA HR-1 alloy with the LP-DED process.\nTesting of a 31 kN nozzle under NASA’s Long-Life Additive\nManufacturing Assembly (LLAMA) project demonstrated 40 starts and\n568 s in a LOX/CH4 environment (Fig. 15A and B). The chamber pres-\nFig. 12. Average LCF life of 2-Step aged LP-DED NASA HR-1 with changes in sure of this assembly was 52 bar, and the mixture ratio was approxi-\ntemperature compared to wrought values in GHe from [2,6].\nmately 3.2. Another test campaign using LOX/GH2 demonstrated high-\nduty cycle hot-fire testing of a NASA HR-1 LP-DED nozzle. Conditions\nand has equivalent or slightly lower LCF life at room temperature were 8.9 kN thrust, and the nozzle achieved 207 starts and just under\ncompared to wrought NASA HR-1 tested in gaseous Helium (GHe) [5,6]. 6800 s (Fig. 15F). This demonstrated temperatures exceeding 760 ◦C on\nA 1-step aging cycle was shown to increase strength with a slight the nozzle hot wall with a chamber pressure over 76 bar and mixture\ndetriment to low cycle fatigue life. These differences in mechanical ratios up to 7.5 using LOX/GH2 propellants. Additional NASA HR-1 LP-\nproperties can be attributed to compositional and microstructural dif- DED units were tested under this campaign with unique design features\nferences between the wrought and LP-DED material. A study on including a scalloped hot wall (tube-like) and spiral channels (Fig. 15E).\nthin-wall builds with reused powder has also been completed with All units performed as intended and met performance predictions. Two\nLP-DED NASA HR-1 and indicated no debit to tensile or LCF properties additional NASA HR-1 LP-DED channel wall nozzle units completed\nafter six reuses [36]. manufacturing and successfully tested using LOX/LH2 at the 156 kN\nThermal conductivity is another key property for LP-DED NASA HR- thrust level (Fig. 15C and D). These units included a spiraled channel\n1, and test results are shown in Fig. 13 where NASA HR-1 is compared to design and incorporated NASA HR-1 LP-DED manifolds. The deposition\nother LP-DED superalloys. The conductivity for NASA HR-1 is very time for the nozzles were approximately 14 days and the manifolds were\nsimilar to Alloy 625 and Alloy 718 and showed an improvement over about 3 days each compared to 6+ months for conventionally\nwrought NASA HR-1 [5].\nNASA HR-1 alloy has been successfully demonstrated for various\nFig. 13. Thermal conductivity of LP-DED NASA HR-1 and other LP-DED alloys Fig. 14. 65% scale RS-25 integral channel LP-DED nozzle using NASA HR-1\nvs temperature. (1.52 m dia. X 1.78 m height).\n491",
      "tables": []
    },
    {
      "page_num": 10,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nFig. 15. NASA HR-1 nozzle test units. A, B) 31 kN integral channel LP-DED nozzle tested in LOX/methane and LOX-cooled, C,D) 156 kN thrust chamber assembly\nand testing E) Spiral tube-like hot wall LP-DED nozzle, F) Hot-fire in LOX/hydrogen testing of 8.9 kN nozzle that accumulated 207 starts and 6800 s.\nmanufactured nozzles. NASA has tested multiple integral channel wall\nTable 4\nnozzles (Fig. 15B) made with LP-DED NASA HR-1 and accumulated over\nCompositions of ODS alloys explored and developed at NASA (wt.%).\n280 starts and 8914 s in hydrogen environments. A total of 313 starts\nand 10,140 s of hot-fire testing has been accumulated across eight NASA Element Alloy\nHR-1 alloy LP-DED nozzles as of 2022. NiCoCr-ODS NiCoCtReB-ODS GRX-810\nNi BAL. BAL. BAL.\n6. High temperature superalloy GRX-810 Co 32 32 33\nCr 30 30 29\nRe – 1.5 1.5\nGRX-810 is a NiCoCr-based ODS alloy specifically developed for AM.\nAl – – 0.3\nThe equiatomic NiCoCr system has been shown to be quite amenable to Ti – – 0.25\nAM [38–40]. This has been attributed to the alloys narrow melting/- Nb – – 0.75\nfreezing temperature range, the difference between the solidus and W – – 3\nliquidus [41]. These studies have reported that the alloy maintains a C – – 0.05\nB – 0.003 –\nsolid solution in both the as-built and heat-treated conditions [40,41]. In\naddition, the AM-produced NiCoCr alloy provides exceptional ductility\nand strain hardening, comparable to its wrought counterparts. In order To produce ODS GRX-810 components, pre-alloyed base powder\nto further improve the high temperature properties of the NiCoCr alloy, with the above composition is coated with <1 wt% Y2O3 nanoparticles.\na coating process for the AM powder feedstock was matured to produce Through L-PBF AM print parameter optimization, these nanoscale ox-\noxide dispersion strengthened components as described by Smith et al. ides are randomly and evenly dispersed throughout the microstructure\n[41]. From this work, three different alloys were explored with the as can be seen below is Fig. 16.\ncomposition shown in Table 4. Notably, out of the three compositions, Scanning electron microscopy images of HIPed GRX-810 reveals a\nGRX-810 provided magnitudes of order better creep strength compared solid solution microstructure with Nb and Ti-rich MC carbides along\nto the NiCoCr-ODS and NiCoCtReB-ODS [42].\n492",
      "tables": []
    },
    {
      "page_num": 11,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nFig. 16. A scanning electron micrograph of HIPed GRX-810 revealing a solid Fig. 17. The tensile properties of HIPed GRX-810 as a function of temperature.\nsolution matrix with grain boundary Nb-rich MC carbides and dispersed\nnanoscale Y2O3 particles.\ngrain boundaries. Nanoscale Y2O3 particles can also be observed, though\nthe resolution of this imaging technique cannot provide quantifiable\ncharacterization. Notably, no bulk oxide or slag formation was observed\nin these samples. From the micrograph in Fig. 16 it is apparent that the\nas-built grain structure is retained even after a high temperature/high\nstress HIP cycle. This provides evidence that the oxides are well\ndistributed and can maintain and stabilize the microstructure at much\nhigher temperatures as compared to non-ODS alloys. Though early in\nthe alloys development phase, it presents promising mechanical results\ncompared to the previous NiCoCr-ODS alloys as well as conventional\nsuperalloys. The tensile and yield strengths for HIPed GRX-810 were\ntested from cryogenic temperatures up to 1093 ◦C. Test results are\nshown below in Fig. 17 (full data in Appendix, Table A).\nFrom Fig. 17, GRX-810 presents excellent tensile properties, specif-\nically when present in extreme environments (cryogenic and high tem-\nperature). The ductility of the alloy remained above 30% at every\ntemperature tested including cryogenic temperatures where it also\nexhibited high strengths. Fig. 18 compares the tensile strength of GRX-\n810 to wrought Alloy 718 and 625. Below 900 ◦C, tensile properties\nare higher for the precipitation strengthened superalloy 718 material.\nHowever, at temperatures above 900 ◦C, the 718 precipitates begin to\nover-age and eventually dissolve at the highest temperatures. In addi-\ntion, grain growth becomes detrimental to non-ODS alloys impacting the\nstrength at elevated temperatures. For GRX-810, this reduction in\nFig. 18. Comparison of the elevated temperature tensile properties of GRX-810\nstrength is much less pronounced due to the presence of the nano oxides\ncompared to conventional wrought superalloys 718 and 625.\nthroughout its microstructure which pin grain boundaries. Therefore,\nGRX-810 presents higher strength than what was possible with non-ODS\nconventional superalloys at temperatures above 900 ◦C. In Fig. 18 GRX- family of powders and the ability to additively manufacture components\nthat may possess better properties than what is currently possible with\n810 is compared to Alloys 625 and 718. These alloys are amenable to the\nconventional materials and manufacturing techniques. The technology\nAM process and used extensively for high temperature AM components.\nto coat and build AM ODS components is not just possible in Ni-alloys\nTherefore, it is important that GRX-810 can also be printed using AM\nbut is speculated to improve the fabrication of difficult to print re-\ntechniques. In Fig. 19, images of complex geometries and components\nfractory alloys or improve the properties of currently printed Cu- and Ti-\nthat have been built with ODS feedstock is shown. Successful hot-fire\nbased alloys. GRX-810 represents a new class of AM materials that is\ntesting of multiple GRX-810 injectors and regeneratively-cooled noz-\nrapidly maturing.\nzles was conducted at NASA MSFC using LOX/LH2 and LOX/LCH4\npropellants at the 31 kN thrust level (Fig. 19C).\nFig. 19 presents evidence of the printability of the coated NiCoCr\n493",
      "tables": []
    },
    {
      "page_num": 12,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nFig. 19. a) An oxide dispersion strengthened 3D printed combustor dome and (b) complex lattice structures, (c) LOX/Methane hot-fire testing of a GRX-810 injector\nand nozzle.\n7. Extreme temperature refractory alloys from over-sized powder, support structures, and sacrificial geometric\nfeatures to be machined away to meet surface finish requirements is\nTraditional refractory metal manufacturing is typically expensive typically only 5–10% of the printed part mass.\ndue to the high material cost, specialized powder production methods, W, Mo, Ta, Re, and various alloys of these have also been produced\nand unique machining and joining methods. Specific difficulties exist in with AM techniques but with a wide range of results [45]. Although\nforming parts due to high ductile-to-brittle transition temperatures, printable, there is a markedly lower level of maturity due in large part to\nultra-high temperature heat treatments, specialized oxidation coatings, limitations in powder suppliers that can provide pre-alloyed powder that\nand non-destructive evaluation (NDE) requirements also provide sig- meets AM process specifications and a lack of high temperature me-\nnificant challenges in manufacturing refractory components [43]. chanical testing that can meet relevant environmental conditions.\nAerospace refractory metal parts tend to be thin-walled (i.e., Commercially available elemental AM grade powder options are\nconverging-diverging nozzles) resulting in 95–98% of the stock being expanded but currently limited to W, Mo, Ta, Re, and Nb; while avail-\nmachined away. Thus, the cost of feedstock for a part is 5% for the actual able alloy powders include C-103 (Nb-10Hf-1Ti-0.7Zr), Ta3W, Ta5W,\npart and 95% in machining waste. Machining and waste disposal add Ta13 W, FS85 (Nb–28Ta–10 W–1Zr), TZM (Mo-0.5Ti-0.08Zr-0.02C),\nadditional costs on top of the feedstock. W–25Re, and Mo–44Re (numerical values have units of wt.%). Custom\nOther manufacturing methods are deposition-based such as vacuum refractory high entropy alloys (RHEA) are in development and are being\nplasma spray, electro-deposition, etc., and tend to be slow and expensive optimized for AM leveraging CALPHAD.\nprocesses. They normally require mandrels that need to be removed post AM refractory metal components suffer from decreased mechanical\ndeposition and that limit part complexity. Due to the difficulty in properties compared to traditional manufacturing methods not only due\ntraditional refractory metal manufacture, there are a limited number of to AM induced micro-cracking but also grain growth at elevated oper-\nvendors with the requisite equipment and experience [43]. ating temperatures [43]. Materials that are strengthened by fine grain\nAM refractory development is a rapidly growing field in AM and has AM microstructure can become ineffective at elevated temperatures as\nbeen conducted primarily with EB-PBF, L-PBF, binder jet, EW-DED, and grain growth occurs. Refractory metals are known to experience this\nLP-DED AM. In most cases, these methods show a significant cost and phenomenon. Carbide-dispersion strengthened (CDS) process is one of\nschedule savings [4]. AM of C-103 is an example. Cost of an AM C-103 the options under development at NASA to not only address\npart has been found to be significantly less than the same part produced micro-cracking during the AM process but also to pin grain boundaries\nby conventional C-103 manufacturing, even when taking into account and retain mechanical properties at expected operating conditions.\npowder feedstock costs, print time, heat treatment, final machining, and Nano powder dispersoids can be mixed with parent metal powder prior\nwaste disposal [44]. L-PBF and LP-DED AM C-103 is now available from to the AM process similar to the ODS GRX-810 alloy or can be precipi-\nseveral commercial AM suppliers to meet increasing demand. AM waste tated during heat treatment, such as HfO2 in AM C-103 as shown in\n494",
      "tables": []
    },
    {
      "page_num": 13,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\n1063 ◦C tensile properties are shown in Fig. 21. Additional process\ndevelopment with C-103 using LP-DED has also been successfully\ndemonstrated.\nDevelopment of pure tungsten was demonstrated using L-PBF for\ncomplex thruster components and fine lattice structures as fine as 100\nμm strut thickness [47]. L-PBF tungsten has also been demonstrated for a\nsimulated 1 N thruster and inductively heated to 2300 ◦C as shown in\nFig. 22.\n8. Summary, outlook, and future work\nNovel alloys are important to advance performance goals such as\ntemperature and pressure capability, corrosion and wear resistance, and\nfatigue life in propulsion components. AM has demonstrated significant\nschedule and cost reduction to manufacture propulsion hardware and is\nbeing used to create complex designs as it both replaces and augments\ntraditional manufacturing techniques. This paper emphasizes the\nimportance of AM implementation that is deliberate and systematic to\nobtain the full potential of technical and economic advantages. With an\nin-depth understanding of various AM processes and their applicability\nwith respect to feedstock materials, NASA has advanced many\ncommonly available AM alloys. These AM alloys, including Copper-,\nIron-, Nickel-, and Refractory-based alloys, have been inserted into\nvarious propulsion applications. Novel alloys being advanced using AM\ninclude GRCop-42, GRCop-84, NASA HR-1, GRX-810, C-103, C-103\nFig. 20. Transmission electron micrograph (TEM) of L-PBF AM as-built C-\nCDS, Mo, and W for specific use in rocket engines for higher perfor-\n103 HfO2 precipitate distribution [43].\nmance. However, there still exists a need to develop other metallic alloys\nthat are only possible to produce with AM to further increase engine\nFig. 20. Note on the figure that dispersoids are the brighter particles that\nperformance. They will enable higher operating temperatures, increased\nare present along grain boundaries and interdendritic regions within the\npressures, and longer life in challenging environments such as oxygen-\ndarker matrix phase.\nrich staged combustion engines.\nDevelopment of AM C-103 for NASA was completed using L-PBF\nNASA has demonstrated various use applications of AM metal alloys\nalong with vacuum stress relief at 1100 ◦C and a HIP cycle to optimize\nmatured and in development for rocket-propulsion components. This\nproperties of the alloy [44]. The achieved density exceeded 99.98% of\nwork covered the entire life cycle of AM starting from formulation, AM\nthe theoretical density in as built and further increased following HIP.\nbuild processes, characterization, heat treat optimizations, microstruc-\nThere was no substantial grain growth following stress relief. Mechan-\nture characterization, mechanical and thermophysical testing, and\nical property testing of the L-PBF demonstrated the ability to achieve\nfinally ending with the engine level hot-fire testing. As of early 2023,\nproperties comparable and in some cases higher than wrought. AM C103\nNASA has accumulated over 100,000 s and 2300 starts on various AM\nmet specification minimums as well [46]. A comparison of 25 ◦C and\nhardware including injectors, chambers, nozzles, turbomachinery, and\nignition systems with many of these using the novel alloys discussed in\nthis paper.\nActivities focused on AM optimized alloys and their process devel-\nopment for high performance applications will continue to be prevalent\nin the next 10 years, mainly because of the rapid technology advance-\nment to be made in ICME. Success in these activities will not only benefit\nFig. 21. Wrought vs. L-PBF C-103 ambient and elevated temperature Fig. 22. A) L-PBF Tungsten 1 N green propulsion chamber, B) heated\nmechanical property comparison [44]. to 2300 ◦C.\n495",
      "tables": []
    },
    {
      "page_num": 14,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nNASA but the entire AM supply chain as well as the global space econ- Conceptualization, Methodology, Writing – Original Draft,\nomy. AM has become one more tool in the manufacturing toolbox and is Investigation.\nbeing accepted for fundamental rapid alloy development and production\nof components. Declaration of competing interest\nWhile there are still many lessons learned in the characterization of\nmetal AM parts and alloys, the AM processes are becoming more widely The authors declare that they have no known competing financial\nadopted. In addition, the local aspect of AM, where organizations are interests or personal relationships that could have appeared to influence\nnow largely responsible for material integrity that is essential to their the work reported in this paper.\ncomponent production, cannot be ignored, particularly with new alloys.\nThe immediate impact is a new emphasis on being integrated across Acknowledgements\ndisciplines and throughout the life cycle of AM components and as-\nsemblies. To successfully integrate these AM alloys requires discipline to This research was funded by NASA under additive manufacturing\ndefine and follow a methodical plan. Well-written standards and speci- development efforts through the Rapid Analysis and Manufacturing\nfications can help vastly. The intentional development of AM alloys for Propulsion Technology (RAMPT), Optimized and Repeatable Compo-\nspecialized aerospace applications is expected to grow, but focus should nents using Additive (ORCA), Refractory Additive Alloy Manufacturing\nbe maintained to fully mature all aspects of the AM life cycle including and Build Optimization (RAAMBO), and Transformational Tools and\nproperty development and demonstration in the application environ- Technologies projects. This paper describes objective technical results\nment. The outlook of AM alloy development for of extreme environ- and analysis. Any subjective views or opinions that might be expressed\nments is very promising. in the paper do not necessarily represent the views of the National\nAeronautics and Space Administration (NASA) or the United States\nAuthor contributions Government. The results from this study are solely for informational\npurposes and not an endorsement of any techniques by the authors, their\nP.R.G. – Conceptualization, Methodology, Writing – Original Draft, employers, or the publishing journal.\nInvestigation, Resources; O.R.M. – Conceptualization, Methodology, The authors would like to thank various partners in the development\nWriting – Original Draft, Investigation, Resources; C.K. – Conceptuali- and advancement of these various alloys including RPM Innovations,\nzation, Methodology, Writing – Original Draft, Investigation; T.M.S. – Tyler Blumenthal/RPMI, Launcher Space (Tim Berry, Max Haot, Andre\nConceptualization, Methodology, Writing – Original Draft, Investiga- Ivankovic), AME, Elementum 3D, Castheon (ADDMan), Powder Alloy\ntion; J.S. –Methodology, Writing – Original Draft, Investigation; A.P. – Corp, Praxair, ATI, Noah Burchett, Declan Dink Murphy, Louisiana State\nMethodology, Review & Editing; P⋅S.C. – Conceptualization, Method- University (LSU) for conductivity testing, Auburn University for char-\nology, Investigation, Review & Editing; D.C.T. – Review & Editing; C⋅S. acterization of NASA HR-1, WMTR, IMR Testing. There are also many\nP. – Conceptualization, Methodology, Investigation, Resources, Review individuals involved in the development of these alloys across NASA and\n& Editing; T.W.T. – Original Draft, Investigation; D.L.E. – Conceptual- industry – thank you. Thank you to Lynn Machamer for help with\nization, Methodology, Investigation, Review & Editing; C.A.K. – graphics and formatting.\nAppendix A\nTable A\nTensile properties of HIPed GRX-810 with respect to temperature.\nTemp. (◦C) Tensile Strength (MPa) Yield Strength (MPa) Elong. (%)\n(cid:0) 195.6 1227.3 723.9 49\n21.1 848.1 515.0 43\n426.7 655.0 410.2 40\n648.9 630.9 368.9 43\n871.1 262.7 206.2 62\n1000.0 164.1 161.3 44\n1093.3 119.3 115.8 32\nReferences Institute of Aeronautics and Astronautics Inc, AIAA, 2018, https://doi.org/\n10.2514/6.2018-4625.\n[6] P.R. Gradl, C.S. Protz, D.L. Ellis, S.E. Greene, Progress in additively manufactured\n[1] B. Blakey-Milner, P. Gradl, G. Snedden, M. Brooks, J. Pitot, E. Lopez, et al., Metal\ncopper-alloy GRCop-84, GRCop-42, and bimetallic combustion chambers for liquid\nadditive manufacturing in aerospace: a review, Mater. Des. 209 (2021), 110008, rocket engines, Proc. Int. Astronaut. Congr. IAC 2019 October 21 (2019) 21–25.\nhttps://doi.org/10.1016/j.matdes.2021.110008.\n[7] P.R. Gradl, C.S. Protz, Technology advancements for channel wall nozzle\n[2] B.N. Bhat (Ed.), Aerospace Materials and Applications, American Institute of\nmanufacturing in liquid rocket engines, Acta Astronaut. 174 (2020), https://doi.\nAeronautics and Astronautics, Inc., Reston ,VA, 2018, https://doi.org/10.2514/\norg/10.1016/j.actaastro.2020.04.067.\n4.104893.\n[8] T.M. Smith, A.C. Thompson, T.P. Gabb, C.L. Bowman, C.A. Kantzos, Efficient\n[3] P. Gradl, D. Tinker, A. Park, O. Mireles, M. Garcia, R. Wilkerson, et al., Robust\nproduction of a high-performance dispersion strengthened, multi-principal element\nmetal additive manufacturing process selection and development for aerospace alloy, Sci Reports 2020 10 (101) (2020) 1–9, https://doi.org/10.1038/s41598-\ncomponents, J. Mater. Eng. Perform. (2021), https://doi.org/10.1007/s11665-\n020-66436-5.\n022-06850-0. Springer.\n[9] National Research Council (U.S, Committee on Integrated Computational Materials\n[4] Paul R. Gradl, Omar R. Mireles, Christopher S. Protz, Chance P. Garcia, Metal\nEngineering. Integrated Computational Materials Engineering : a Transformational\nAdditive Manufacturing for Propulsion Applications, first ed., American Institute of\nDiscipline for Improved Competitiveness and National Security, 2008, p. 137.\nAeronautics and Astronautics, Inc., Reston, VA, 2022 https://doi.org/10.2514/\n[10] M. Seifi, A. Salem, J. Beuth, O. Harrysson, J.J. Lewandowski, Overview of\n4.106279.\nmaterials qualification needs for metal additive manufacturing, J. Occup. Med. 68\n[5] P.R. Gradl, S.E. Greene, C. Protz, B. Bullard, J. Buzzell, C. Garcia, et al., Additive (2016) 747–764, https://doi.org/10.1007/s11837-015-1810-0.\nmanufacturing of liquid rocket engine combustion devices: a summary of process\n[11] Song Q. song, Y. Zhang, Wei Y. feng, Zhou X. yi, Shen Y. fu, Y min Zhou, et al.,\ndevelopments and hot-fire testing results, in: 2018 Jt. Propuls. Conf., American\nMicrostructure and mechanical performance of ODS superalloys manufactured by\n496",
      "tables": []
    },
    {
      "page_num": 15,
      "text": "P. Gradl et al. A c t a A s t r o n a u t i c a 211(2023)483–497\nselective laser melting, Opt Laser. Technol. 144 (2021), 107423, https://doi.org/ [30] T.W. Teasley, T.M. Fedotowsky, P.R. Gradl, B.L. Austin, S.D. Heister, Current state\n10.1016/j.optlastec.2021.107423. of NASA continuously rotating detonation cycle engine development, AIAA Scitech\n[12] F. Kerstens, A. Cervone, P. Gradl, End to end process evaluation for additively 2023 (2023) 1–24, https://doi.org/10.2514/6.2023-1873. AIAA.\nmanufactured liquid rocket engine thrust chambers, Acta Astronaut. 182 (2021) [31] C. Katsarelis, P. Chen, P.R. Gradl, C. Protz, Z. Jones, N. Marshall, et al., Additive\n454–465, https://doi.org/10.1016/j.actaastro.2021.02.034. manufacturing of NASA HR-1 material for liquid rocket engine component\n[13] R.P. Minneci, E.A. Lass, J.R. Bunn, H. Choo, C.J. Rawn, Copper-based alloys for applications, JANNAF Jt Propuls Conf (2019). https://ntrs.nasa.gov/search.jsp?\nstructural high-heat-flux applications: a review of development, properties, and R=20200001007.\nperformance of Cu-rich Cu–Cr–Nb alloys, Int. Mater. Rev. (2020), https://doi.org/ [32] P.S. Chen, C.C. Katsarelis, W.M. Medders, P.R. Gradl, Segregation Evolution and\n10.1080/09506608.2020.1821485. Diffusion of Titanium in Directed Energy Deposited, NASA Tech Memo. https://n\n[14] J. Lee. Hydrogen embrittlement. NASA Technical Memorandum, 2016. NASA/TM- trs.nasa.gov/citations/20210013649.\n2016–218602, https://ntrs.nasa.gov/citations/20160005654. NASA/TM- [33] P.R. Gradl, T.W. Teasley, C.S. Protz, C. Katsarelis, P. Chen, Process development\n2016–218602. and hot-fire testing of additively manufactured NASA HR-1 for liquid rocket engine\n[15] M. Li, S.J. Zinkle, Physical and mechanical properties of copper and copper alloys, applications, AIAA Propuls. Energy 2021 (2021) 1–23, https://doi.org/10.2514/\nCompr Nucl Mater 4 (2012) 667–690, https://doi.org/10.1016/B978-0-08- 6.2021-3236.\n056033-5.00122-1. [34] P.-S. Chen, M. Mitchell, Aerospace Structural Metals Handbook Alloy NASA-HR-1\n[16] H.C. DeGroh, D.L. Ellis, W.S. Loewenthal, Comparison of GRCop-84 to other Cu Nickel Base Alloys-Ni, 2005.\nalloys with high thermal conductivities, J. Mater. Eng. Perform. 17 (2008) [35] P.S. Chen, C.C. Katsarelis, W.M. Medders, P.R. Gradl, C.H. Su, Development of\n594–606, https://doi.org/10.1007/s11665-007-9175-3. directed energy deposited NASA HR-1 to optimize properties for liquid rocket\n[17] P.R. Gradl, C. Protz, K. Cooper, C. Garcia, D. Ellis, L. Evans, GRCop-42 engine applications, NASA Tech. Memo. NASA/TM-20230006075. ntrs.nasa.gov\ndevelopment and hot-fire testing using additive manufacturing powder bed fusion (2023).\nfor channel-cooled combustion chambers, AIAA Propuls. Energy Forum Expo 2019 [36] A. Soltani-tehrani, P. Chen, C. Katsarelis, P. Gradl, S. Shao, Thin-Walled Structures\n(2019), https://doi.org/10.2514/6.2019-4228. American Institute of Aeronautics Mechanical properties of laser powder directed energy deposited NASA HR-1\nand Astronautics Inc, AIAA. superalloy : effects of powder reuse and part orientation, Thin-Walled Struct. 185\n[18] J. Svoboda, V. Horník, L. Stratil, H. Hadraba, B. Maˇsek, O. Khalaj, et al., (2023), 110636, https://doi.org/10.1016/j.tws.2023.110636.\nMicrostructure evolution in ods alloys with a high-volume fraction of nano oxides, [37] P. Gradl, A. Cervone, P. Colonna, Integral Channel nozzles and heat exchangers\nMetals 8 (2018), https://doi.org/10.3390/met8121079. using additive manufacturing directed energy deposition NASA HR-1 alloy, 73rd\n[19] W.J. Quadakkers, H. Holzbrecher, K.G. Briefs, H. Beske, Differences in Growth Int. Astronaut. Congr., Paris, France 2 (2022), x73690. IAC-22,C4.\nMechanisms of Oxide Scales Formed on ODS and Conventional Wrought Alloys, [38] Y. Brif, M. Thomas, I. Todd, The use of high-entropy alloys in additive\nvol. 32, 1989. manufacturing, Scripta Mater. 99 (2015) 93–96, https://doi.org/10.1016/j.\n[20] T.M. Smith, C.A. Kantzos, N.A. Zarkevich, B.J. Harder, M. Heczko, P.R. Gradl, et scriptamat.2014.11.037.\nal., A 3D printable alloy designed for extreme environments, Nature (2023), [39] S. Chen, Y. Tong, P.K. Liaw, Additive manufacturing of high-entropy alloys: a\nhttps://doi.org/10.1038/s41586-023-05893-0. review, Entropy 20 (2018), https://doi.org/10.3390/e20120937.\n[21] J. Wadsworth, T.G. Nieh, J.J. Stephens, Recent advances in aerospace refractory [40] F. Weng, Y. Chew, Z. Zhu, X. Yao, L. Wang, F.L. Ng, et al., Excellent combination of\nmetal alloys 33 (2013) 131, https://doi.org/10.1179/IMR.1988.33.1.131, 50. strength and ductility of CoCrNi medium entropy alloy fabricated by laser aided\n[22] P.R. Gradl, S. Elam Greene, C.S. Protz, D.L. Ellis, B.A. Lerch, S.E. Greene, et al., additive manufacturing, Addit. Manuf. 34 (2020), 101202, https://doi.org/\nDevelopment and hot-fire testing of additively manufactured copper combustion 10.1016/j.addma.2020.101202.\nchambers for liquid rocket engine applications, 53rd AIAA/SAE/ASEE Jt Propuls [41] T.M. Smith, A.C. Thompson, T.P. Gabb, C.L. Bowman, C.A. Kantzos, Efficient\nConf 1–27 (2017), https://doi.org/10.2514/6.2017-4670. production of a high-performance dispersion element alloy, Sci. Rep. (2020) 1–9,\n[23] Ogbuji Lu, D.L. Humphrey, J.A. Setlock, Oxidation-reduction resistance of https://doi.org/10.1038/s41598-020-66436-5.\nadvanced copper alloys August (2003). [42] T.M. Smith, Additive Manufactured Alloys for HighTemperature Applications,\n[24] Ogbuji Lu, D.L. Humphrey. Oxidation of Copper Alloy Candidates for Rocket NASA T2 Webinar, 2022.\nEngine Applications, National Space and Missile Materials Symposium, Colorado [43] O. Mireles, Additive manufacture of refractory metals for aerospace applications,\nSprings, CO, 2002. AIAA Propuls. Energy 2020 Forum (2021) 1–9, https://doi.org/10.2514/6.2021-\n[25] D.L. Ellis, K. Taminger, C. Protz, J. Fikes, Low-Cost Upper Stage-Class Propulsion 3234.\n(LCUSP): Final Report, 2022. [44] O.R. Mireles, O. Rodriguez, Y. Gao, N. Philips, Additive Manufacture of Refractory\n[26] Ellis DL, Loewenthal WS, Yun HM. Tensile Properties of GRCop-84. Nasa/Tm- Alloy C103 for Propulsion Applications. AIAA Propuls. Energy 2020 Forum,\n2012-217108 2012. American Institute of Aeronautics and Astronautics Inc, AIAA, 2020, pp. 1–13,\n[27] T.W. Teasley, NASA Succeeds in Testing of Advanced Rotating Detonation Rocket https://doi.org/10.2514/6.2020-3500.\nEngine for New US Space Flight Capability, 2022. [45] A. Talignani, R. Seede, A. Whitt, S. Zheng, J. Ye, I. Karaman, et al., A review on\n[28] P.R. Gradl, T.W. Teasley, C.S. Protz, M.B. Garcia, D. Ellis, C. Kantzos, Advancing additive manufacturing of refractory tungsten and tungsten alloys, Addit. Manuf.\nGRCop-based bimetallic additive manufacturing to optimize component design and 58 (2022), 103009, https://doi.org/10.1016/J.ADDMA.2022.103009.\napplications for liquid rocket engines, AIAA Propuls. Energy 2021 (2021) 1–28, [46] P.D. Awasthi, P. Agrawal, R.S. Haridas, R.S. Mishra, M.T. Stawovy, S. Ohm, et al.,\nhttps://doi.org/10.2514/6.2021-3231. Mechanical properties and microstructural characteristics of additively\n[29] T. Teasley, B. Williams, A. Larkey, C. Protz, P. Gradl, A review towards the design manufactured C103 niobium alloy, Mater. Sci. Eng., A 831 (2022), 142183,\noptimization of high-performance additively manufactured rotating detonation https://doi.org/10.1016/J.MSEA.2021.142183.\nrocket engine injectors, AIAA Propuls Energy Forum (2021 2021), https://doi.org/ [47] C.J. Romnes, J.F. Stubbins, O.R. Mireles, Tuning the properties of additively\n10.2514/6.2021-3655. manufactured tungsten ultra-fine lattices by adjusting laser energy density and\nlattice geometry, J. Mater. Eng. Perform. (2022 2022) 1–14, https://doi.org/\n10.1007/S11665-022-07126-3.\n497",
      "tables": []
    }
  ]
}